/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8)
                .offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const LYS_COMPILE_GROUPING: u32 = 1;
pub const LYS_COMPILE_DISABLED: u32 = 2;
pub const LYS_COMPILE_NO_CONFIG: u32 = 4;
pub const LYS_COMPILE_NO_DISABLED: u32 = 8;
pub const LYS_COMPILE_RPC_INPUT: u32 = 4100;
pub const LYS_COMPILE_RPC_OUTPUT: u32 = 8196;
pub const LYS_COMPILE_NOTIFICATION: u32 = 16388;
pub const LY_PRINT_SHRINK: u32 = 2;
pub const LY_PATH_BEGIN_ABSOLUTE: u32 = 1;
pub const LY_PATH_BEGIN_EITHER: u32 = 2;
pub const LY_PATH_PREFIX_OPTIONAL: u32 = 16;
pub const LY_PATH_PREFIX_MANDATORY: u32 = 32;
pub const LY_PATH_PREFIX_FIRST: u32 = 64;
pub const LY_PATH_PREFIX_STRICT_INHERIT: u32 = 128;
pub const LY_PATH_PRED_KEYS: u32 = 256;
pub const LY_PATH_PRED_SIMPLE: u32 = 512;
pub const LY_PATH_PRED_LEAFREF: u32 = 1024;
pub const LY_PATH_OPER_INPUT: u32 = 1;
pub const LY_PATH_OPER_OUTPUT: u32 = 2;
pub const LY_PATH_TARGET_SINGLE: u32 = 16;
pub const LY_PATH_TARGET_MANY: u32 = 32;
pub const LYD_PRINT_WITHSIBLINGS: u32 = 1;
pub const LYD_PRINT_SHRINK: u32 = 2;
pub const LYD_PRINT_KEEPEMPTYCONT: u32 = 4;
pub const LYD_PRINT_WD_MASK: u32 = 240;
pub const LYD_PRINT_WD_EXPLICIT: u32 = 0;
pub const LYD_PRINT_WD_TRIM: u32 = 16;
pub const LYD_PRINT_WD_ALL: u32 = 32;
pub const LYD_PRINT_WD_ALL_TAG: u32 = 64;
pub const LYD_PRINT_WD_IMPL_TAG: u32 = 128;
pub const LYS_PRINT_SHRINK: u32 = 2;
pub const LYS_PRINT_NO_SUBSTMT: u32 = 16;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"]
        [::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ly_ctx {
    _unused: [u8; 0],
}
pub type ly_bool = u8;
pub mod LY_LOG_LEVEL {
    pub type Type = ::std::os::raw::c_uint;
    pub const LY_LLERR: Type = 0;
    pub const LY_LLWRN: Type = 1;
    pub const LY_LLVRB: Type = 2;
    pub const LY_LLDBG: Type = 3;
}
unsafe extern "C" {
    pub fn ly_log_level(level: LY_LOG_LEVEL::Type) -> LY_LOG_LEVEL::Type;
}
unsafe extern "C" {
    pub fn ly_log_options(opts: u32) -> u32;
}
unsafe extern "C" {
    pub fn ly_temp_log_options(opts: *mut u32) -> *mut u32;
}
unsafe extern "C" {
    pub fn ly_log_dbg_groups(dbg_groups: u32) -> u32;
}
pub type ly_log_clb = ::std::option::Option<
    unsafe extern "C" fn(
        level: LY_LOG_LEVEL::Type,
        msg: *const ::std::os::raw::c_char,
        data_path: *const ::std::os::raw::c_char,
        schema_path: *const ::std::os::raw::c_char,
        line: u64,
    ),
>;
unsafe extern "C" {
    pub fn ly_set_log_clb(clb: ly_log_clb);
}
unsafe extern "C" {
    pub fn ly_get_log_clb() -> ly_log_clb;
}
pub mod LY_ERR {
    pub type Type = ::std::os::raw::c_uint;
    pub const LY_SUCCESS: Type = 0;
    pub const LY_EMEM: Type = 1;
    pub const LY_ESYS: Type = 2;
    pub const LY_EINVAL: Type = 3;
    pub const LY_EEXIST: Type = 4;
    pub const LY_ENOTFOUND: Type = 5;
    pub const LY_EINT: Type = 6;
    pub const LY_EVALID: Type = 7;
    pub const LY_EDENIED: Type = 8;
    pub const LY_EINCOMPLETE: Type = 9;
    pub const LY_ERECOMPILE: Type = 10;
    pub const LY_ENOT: Type = 11;
    pub const LY_EOTHER: Type = 12;
    pub const LY_EPLUGIN: Type = 128;
}
pub mod LY_VECODE {
    pub type Type = ::std::os::raw::c_uint;
    pub const LYVE_SUCCESS: Type = 0;
    pub const LYVE_SYNTAX: Type = 1;
    pub const LYVE_SYNTAX_YANG: Type = 2;
    pub const LYVE_SYNTAX_YIN: Type = 3;
    pub const LYVE_REFERENCE: Type = 4;
    pub const LYVE_XPATH: Type = 5;
    pub const LYVE_SEMANTICS: Type = 6;
    pub const LYVE_SYNTAX_XML: Type = 7;
    pub const LYVE_SYNTAX_JSON: Type = 8;
    pub const LYVE_DATA: Type = 9;
    pub const LYVE_OTHER: Type = 10;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ly_err_item {
    pub level: LY_LOG_LEVEL::Type,
    pub err: LY_ERR::Type,
    pub vecode: LY_VECODE::Type,
    pub msg: *mut ::std::os::raw::c_char,
    pub data_path: *mut ::std::os::raw::c_char,
    pub schema_path: *mut ::std::os::raw::c_char,
    pub line: u64,
    pub apptag: *mut ::std::os::raw::c_char,
    pub next: *mut ly_err_item,
    pub prev: *mut ly_err_item,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ly_err_item"][::std::mem::size_of::<ly_err_item>() - 72usize];
    ["Alignment of ly_err_item"]
        [::std::mem::align_of::<ly_err_item>() - 8usize];
    ["Offset of field: ly_err_item::level"]
        [::std::mem::offset_of!(ly_err_item, level) - 0usize];
    ["Offset of field: ly_err_item::err"]
        [::std::mem::offset_of!(ly_err_item, err) - 4usize];
    ["Offset of field: ly_err_item::vecode"]
        [::std::mem::offset_of!(ly_err_item, vecode) - 8usize];
    ["Offset of field: ly_err_item::msg"]
        [::std::mem::offset_of!(ly_err_item, msg) - 16usize];
    ["Offset of field: ly_err_item::data_path"]
        [::std::mem::offset_of!(ly_err_item, data_path) - 24usize];
    ["Offset of field: ly_err_item::schema_path"]
        [::std::mem::offset_of!(ly_err_item, schema_path) - 32usize];
    ["Offset of field: ly_err_item::line"]
        [::std::mem::offset_of!(ly_err_item, line) - 40usize];
    ["Offset of field: ly_err_item::apptag"]
        [::std::mem::offset_of!(ly_err_item, apptag) - 48usize];
    ["Offset of field: ly_err_item::next"]
        [::std::mem::offset_of!(ly_err_item, next) - 56usize];
    ["Offset of field: ly_err_item::prev"]
        [::std::mem::offset_of!(ly_err_item, prev) - 64usize];
};
impl Default for ly_err_item {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn ly_strerr(err: LY_ERR::Type) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_strvecode(
        vecode: LY_VECODE::Type,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_last_logmsg() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ly_err_first(ctx: *const ly_ctx) -> *const ly_err_item;
}
unsafe extern "C" {
    pub fn ly_err_last(ctx: *const ly_ctx) -> *const ly_err_item;
}
unsafe extern "C" {
    pub fn ly_err_print(ctx: *const ly_ctx, eitem: *const ly_err_item);
}
unsafe extern "C" {
    pub fn ly_err_clean(ctx: *mut ly_ctx, eitem: *mut ly_err_item);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ly_in {
    _unused: [u8; 0],
}
pub mod LYS_INFORMAT {
    pub type Type = ::std::os::raw::c_uint;
    pub const LYS_IN_UNKNOWN: Type = 0;
    pub const LYS_IN_YANG: Type = 1;
    pub const LYS_IN_YIN: Type = 3;
}
unsafe extern "C" {
    pub fn lys_parse(
        ctx: *mut ly_ctx,
        in_: *mut ly_in,
        format: LYS_INFORMAT::Type,
        features: *mut *const ::std::os::raw::c_char,
        module: *mut *mut lys_module,
    ) -> LY_ERR::Type;
}
unsafe extern "C" {
    pub fn lys_parse_mem(
        ctx: *mut ly_ctx,
        data: *const ::std::os::raw::c_char,
        format: LYS_INFORMAT::Type,
        module: *mut *mut lys_module,
    ) -> LY_ERR::Type;
}
unsafe extern "C" {
    pub fn lys_parse_fd(
        ctx: *mut ly_ctx,
        fd: ::std::os::raw::c_int,
        format: LYS_INFORMAT::Type,
        module: *mut *mut lys_module,
    ) -> LY_ERR::Type;
}
unsafe extern "C" {
    pub fn lys_parse_path(
        ctx: *mut ly_ctx,
        path: *const ::std::os::raw::c_char,
        format: LYS_INFORMAT::Type,
        module: *mut *mut lys_module,
    ) -> LY_ERR::Type;
}
unsafe extern "C" {
    pub fn lys_search_localfile(
        searchpaths: *const *const ::std::os::raw::c_char,
        cwd: ly_bool,
        name: *const ::std::os::raw::c_char,
        revision: *const ::std::os::raw::c_char,
        localfile: *mut *mut ::std::os::raw::c_char,
        format: *mut LYS_INFORMAT::Type,
    ) -> LY_ERR::Type;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"]
        [::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"]
        [::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
impl Default for iovec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"]
        [::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"]
        [::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"]
        [::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"]
        [::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"]
        [::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"]
        [::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"][::std::mem::align_of::<
        __atomic_wide_counter__bindgen_ty_1,
    >() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"][::std::mem::offset_of!(
        __atomic_wide_counter__bindgen_ty_1,
        __low
    ) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"][::std::mem::offset_of!(
        __atomic_wide_counter__bindgen_ty_1,
        __high
    )
        - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"]
        [::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
impl Default for __atomic_wide_counter {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"]
        [::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
impl Default for __pthread_internal_list {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
impl Default for __pthread_internal_slist {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"]
        [::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"]
        [::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"]
        [::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"][::std::mem::offset_of!(
        __pthread_rwlock_arch_t,
        __wrphase_futex
    ) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"][::std::mem::offset_of!(
        __pthread_rwlock_arch_t,
        __writers_futex
    ) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"][::std::mem::offset_of!(
        __pthread_rwlock_arch_t,
        __cur_writer
    ) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"][::std::mem::offset_of!(
        __pthread_rwlock_arch_t,
        __rwelision
    ) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"]
        [::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"]
        [::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
impl Default for __pthread_cond_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"]
        [::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"]
        [::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"]
        [::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"]
        [::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
impl Default for pthread_mutexattr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"]
        [::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"]
        [::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
impl Default for pthread_condattr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"]
        [::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"]
        [::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
impl Default for pthread_attr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"]
        [::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"]
        [::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
impl Default for pthread_mutex_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"]
        [::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"]
        [::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
impl Default for pthread_cond_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"]
        [::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"]
        [::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
impl Default for pthread_rwlock_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"]
        [::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"]
        [::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
impl Default for pthread_rwlockattr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"]
        [::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"]
        [::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
impl Default for pthread_barrier_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"]
        [::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
impl Default for pthread_barrierattr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type socklen_t = __socklen_t;
pub mod __socket_type {
    pub type Type = ::std::os::raw::c_uint;
    pub const SOCK_STREAM: Type = 1;
    pub const SOCK_DGRAM: Type = 2;
    pub const SOCK_RAW: Type = 3;
    pub const SOCK_RDM: Type = 4;
    pub const SOCK_SEQPACKET: Type = 5;
    pub const SOCK_DCCP: Type = 6;
    pub const SOCK_PACKET: Type = 10;
    pub const SOCK_CLOEXEC: Type = 524288;
    pub const SOCK_NONBLOCK: Type = 2048;
}
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr"][::std::mem::size_of::<sockaddr>() - 16usize];
    ["Alignment of sockaddr"][::std::mem::align_of::<sockaddr>() - 2usize];
    ["Offset of field: sockaddr::sa_family"]
        [::std::mem::offset_of!(sockaddr, sa_family) - 0usize];
    ["Offset of field: sockaddr::sa_data"]
        [::std::mem::offset_of!(sockaddr, sa_data) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_storage"]
        [::std::mem::size_of::<sockaddr_storage>() - 128usize];
    ["Alignment of sockaddr_storage"]
        [::std::mem::align_of::<sockaddr_storage>() - 8usize];
    ["Offset of field: sockaddr_storage::ss_family"]
        [::std::mem::offset_of!(sockaddr_storage, ss_family) - 0usize];
    ["Offset of field: sockaddr_storage::__ss_padding"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_padding) - 2usize];
    ["Offset of field: sockaddr_storage::__ss_align"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_align) - 120usize];
};
impl Default for sockaddr_storage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub mod _bindgen_ty_1 {
    pub type Type = ::std::os::raw::c_uint;
    pub const MSG_OOB: Type = 1;
    pub const MSG_PEEK: Type = 2;
    pub const MSG_DONTROUTE: Type = 4;
    pub const MSG_CTRUNC: Type = 8;
    pub const MSG_PROXY: Type = 16;
    pub const MSG_TRUNC: Type = 32;
    pub const MSG_DONTWAIT: Type = 64;
    pub const MSG_EOR: Type = 128;
    pub const MSG_WAITALL: Type = 256;
    pub const MSG_FIN: Type = 512;
    pub const MSG_SYN: Type = 1024;
    pub const MSG_CONFIRM: Type = 2048;
    pub const MSG_RST: Type = 4096;
    pub const MSG_ERRQUEUE: Type = 8192;
    pub const MSG_NOSIGNAL: Type = 16384;
    pub const MSG_MORE: Type = 32768;
    pub const MSG_WAITFORONE: Type = 65536;
    pub const MSG_BATCH: Type = 262144;
    pub const MSG_ZEROCOPY: Type = 67108864;
    pub const MSG_FASTOPEN: Type = 536870912;
    pub const MSG_CMSG_CLOEXEC: Type = 1073741824;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msghdr"][::std::mem::size_of::<msghdr>() - 56usize];
    ["Alignment of msghdr"][::std::mem::align_of::<msghdr>() - 8usize];
    ["Offset of field: msghdr::msg_name"]
        [::std::mem::offset_of!(msghdr, msg_name) - 0usize];
    ["Offset of field: msghdr::msg_namelen"]
        [::std::mem::offset_of!(msghdr, msg_namelen) - 8usize];
    ["Offset of field: msghdr::msg_iov"]
        [::std::mem::offset_of!(msghdr, msg_iov) - 16usize];
    ["Offset of field: msghdr::msg_iovlen"]
        [::std::mem::offset_of!(msghdr, msg_iovlen) - 24usize];
    ["Offset of field: msghdr::msg_control"]
        [::std::mem::offset_of!(msghdr, msg_control) - 32usize];
    ["Offset of field: msghdr::msg_controllen"]
        [::std::mem::offset_of!(msghdr, msg_controllen) - 40usize];
    ["Offset of field: msghdr::msg_flags"]
        [::std::mem::offset_of!(msghdr, msg_flags) - 48usize];
};
impl Default for msghdr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cmsghdr"][::std::mem::size_of::<cmsghdr>() - 16usize];
    ["Alignment of cmsghdr"][::std::mem::align_of::<cmsghdr>() - 8usize];
    ["Offset of field: cmsghdr::cmsg_len"]
        [::std::mem::offset_of!(cmsghdr, cmsg_len) - 0usize];
    ["Offset of field: cmsghdr::cmsg_level"]
        [::std::mem::offset_of!(cmsghdr, cmsg_level) - 8usize];
    ["Offset of field: cmsghdr::cmsg_type"]
        [::std::mem::offset_of!(cmsghdr, cmsg_type) - 12usize];
    ["Offset of field: cmsghdr::__cmsg_data"]
        [::std::mem::offset_of!(cmsghdr, __cmsg_data) - 16usize];
};
unsafe extern "C" {
    pub fn __cmsg_nxthdr(
        __mhdr: *mut msghdr,
        __cmsg: *mut cmsghdr,
    ) -> *mut cmsghdr;
}
pub mod _bindgen_ty_2 {
    pub type Type = ::std::os::raw::c_uint;
    pub const SCM_RIGHTS: Type = 1;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"]
        [::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"]
        [::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"]
        [::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"]
        [::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of linger"][::std::mem::size_of::<linger>() - 8usize];
    ["Alignment of linger"][::std::mem::align_of::<linger>() - 4usize];
    ["Offset of field: linger::l_onoff"]
        [::std::mem::offset_of!(linger, l_onoff) - 0usize];
    ["Offset of field: linger::l_linger"]
        [::std::mem::offset_of!(linger, l_linger) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of osockaddr"][::std::mem::size_of::<osockaddr>() - 16usize];
    ["Alignment of osockaddr"][::std::mem::align_of::<osockaddr>() - 2usize];
    ["Offset of field: osockaddr::sa_family"]
        [::std::mem::offset_of!(osockaddr, sa_family) - 0usize];
    ["Offset of field: osockaddr::sa_data"]
        [::std::mem::offset_of!(osockaddr, sa_data) - 2usize];
};
pub mod _bindgen_ty_3 {
    pub type Type = ::std::os::raw::c_uint;
    pub const SHUT_RD: Type = 0;
    pub const SHUT_WR: Type = 1;
    pub const SHUT_RDWR: Type = 2;
}
unsafe extern "C" {
    pub fn socket(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn socketpair(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
        __fds: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bind(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsockname(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn connect(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getpeername(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn send(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recv(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendto(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __addr_len: socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvfrom(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn sendmsg(
        __fd: ::std::os::raw::c_int,
        __message: *const msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn recvmsg(
        __fd: ::std::os::raw::c_int,
        __message: *mut msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *mut ::std::os::raw::c_void,
        __optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *const ::std::os::raw::c_void,
        __optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn listen(
        __fd: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn accept(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn shutdown(
        __fd: ::std::os::raw::c_int,
        __how: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isfdtype(
        __fd: ::std::os::raw::c_int,
        __fdtype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"]
        [::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_opts"][::std::mem::size_of::<ip_opts>() - 44usize];
    ["Alignment of ip_opts"][::std::mem::align_of::<ip_opts>() - 4usize];
    ["Offset of field: ip_opts::ip_dst"]
        [::std::mem::offset_of!(ip_opts, ip_dst) - 0usize];
    ["Offset of field: ip_opts::ip_opts"]
        [::std::mem::offset_of!(ip_opts, ip_opts) - 4usize];
};
impl Default for ip_opts {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreqn"][::std::mem::size_of::<ip_mreqn>() - 12usize];
    ["Alignment of ip_mreqn"][::std::mem::align_of::<ip_mreqn>() - 4usize];
    ["Offset of field: ip_mreqn::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreqn, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreqn::imr_address"]
        [::std::mem::offset_of!(ip_mreqn, imr_address) - 4usize];
    ["Offset of field: ip_mreqn::imr_ifindex"]
        [::std::mem::offset_of!(ip_mreqn, imr_ifindex) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_pktinfo"][::std::mem::size_of::<in_pktinfo>() - 12usize];
    ["Alignment of in_pktinfo"][::std::mem::align_of::<in_pktinfo>() - 4usize];
    ["Offset of field: in_pktinfo::ipi_ifindex"]
        [::std::mem::offset_of!(in_pktinfo, ipi_ifindex) - 0usize];
    ["Offset of field: in_pktinfo::ipi_spec_dst"]
        [::std::mem::offset_of!(in_pktinfo, ipi_spec_dst) - 4usize];
    ["Offset of field: in_pktinfo::ipi_addr"]
        [::std::mem::offset_of!(in_pktinfo, ipi_addr) - 8usize];
};
pub mod _bindgen_ty_4 {
    pub type Type = ::std::os::raw::c_uint;
    pub const IPPROTO_IP: Type = 0;
    pub const IPPROTO_ICMP: Type = 1;
    pub const IPPROTO_IGMP: Type = 2;
    pub const IPPROTO_IPIP: Type = 4;
    pub const IPPROTO_TCP: Type = 6;
    pub const IPPROTO_EGP: Type = 8;
    pub const IPPROTO_PUP: Type = 12;
    pub const IPPROTO_UDP: Type = 17;
    pub const IPPROTO_IDP: Type = 22;
    pub const IPPROTO_TP: Type = 29;
    pub const IPPROTO_DCCP: Type = 33;
    pub const IPPROTO_IPV6: Type = 41;
    pub const IPPROTO_RSVP: Type = 46;
    pub const IPPROTO_GRE: Type = 47;
    pub const IPPROTO_ESP: Type = 50;
    pub const IPPROTO_AH: Type = 51;
    pub const IPPROTO_MTP: Type = 92;
    pub const IPPROTO_BEETPH: Type = 94;
    pub const IPPROTO_ENCAP: Type = 98;
    pub const IPPROTO_PIM: Type = 103;
    pub const IPPROTO_COMP: Type = 108;
    pub const IPPROTO_SCTP: Type = 132;
    pub const IPPROTO_UDPLITE: Type = 136;
    pub const IPPROTO_MPLS: Type = 137;
    pub const IPPROTO_ETHERNET: Type = 143;
    pub const IPPROTO_RAW: Type = 255;
    pub const IPPROTO_MPTCP: Type = 262;
    pub const IPPROTO_MAX: Type = 263;
}
pub mod _bindgen_ty_5 {
    pub type Type = ::std::os::raw::c_uint;
    pub const IPPROTO_HOPOPTS: Type = 0;
    pub const IPPROTO_ROUTING: Type = 43;
    pub const IPPROTO_FRAGMENT: Type = 44;
    pub const IPPROTO_ICMPV6: Type = 58;
    pub const IPPROTO_NONE: Type = 59;
    pub const IPPROTO_DSTOPTS: Type = 60;
    pub const IPPROTO_MH: Type = 135;
}
pub type in_port_t = u16;
pub mod _bindgen_ty_6 {
    pub type Type = ::std::os::raw::c_uint;
    pub const IPPORT_ECHO: Type = 7;
    pub const IPPORT_DISCARD: Type = 9;
    pub const IPPORT_SYSTAT: Type = 11;
    pub const IPPORT_DAYTIME: Type = 13;
    pub const IPPORT_NETSTAT: Type = 15;
    pub const IPPORT_FTP: Type = 21;
    pub const IPPORT_TELNET: Type = 23;
    pub const IPPORT_SMTP: Type = 25;
    pub const IPPORT_TIMESERVER: Type = 37;
    pub const IPPORT_NAMESERVER: Type = 42;
    pub const IPPORT_WHOIS: Type = 43;
    pub const IPPORT_MTP: Type = 57;
    pub const IPPORT_TFTP: Type = 69;
    pub const IPPORT_RJE: Type = 77;
    pub const IPPORT_FINGER: Type = 79;
    pub const IPPORT_TTYLINK: Type = 87;
    pub const IPPORT_SUPDUP: Type = 95;
    pub const IPPORT_EXECSERVER: Type = 512;
    pub const IPPORT_LOGINSERVER: Type = 513;
    pub const IPPORT_CMDSERVER: Type = 514;
    pub const IPPORT_EFSSERVER: Type = 520;
    pub const IPPORT_BIFFUDP: Type = 512;
    pub const IPPORT_WHOSERVER: Type = 513;
    pub const IPPORT_ROUTESERVER: Type = 520;
    pub const IPPORT_RESERVED: Type = 1024;
    pub const IPPORT_USERRESERVED: Type = 5000;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"]
        [::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 4usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr8"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr8) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr16"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr16) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr32"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr32) - 0usize];
};
impl Default for in6_addr__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 4usize];
    ["Offset of field: in6_addr::__in6_u"]
        [::std::mem::offset_of!(in6_addr, __in6_u) - 0usize];
};
impl Default for in6_addr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub static in6addr_any: in6_addr;
}
unsafe extern "C" {
    pub static in6addr_loopback: in6_addr;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in"][::std::mem::size_of::<sockaddr_in>() - 16usize];
    ["Alignment of sockaddr_in"]
        [::std::mem::align_of::<sockaddr_in>() - 4usize];
    ["Offset of field: sockaddr_in::sin_family"]
        [::std::mem::offset_of!(sockaddr_in, sin_family) - 0usize];
    ["Offset of field: sockaddr_in::sin_port"]
        [::std::mem::offset_of!(sockaddr_in, sin_port) - 2usize];
    ["Offset of field: sockaddr_in::sin_addr"]
        [::std::mem::offset_of!(sockaddr_in, sin_addr) - 4usize];
    ["Offset of field: sockaddr_in::sin_zero"]
        [::std::mem::offset_of!(sockaddr_in, sin_zero) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in6"][::std::mem::size_of::<sockaddr_in6>() - 28usize];
    ["Alignment of sockaddr_in6"]
        [::std::mem::align_of::<sockaddr_in6>() - 4usize];
    ["Offset of field: sockaddr_in6::sin6_family"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_family) - 0usize];
    ["Offset of field: sockaddr_in6::sin6_port"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_port) - 2usize];
    ["Offset of field: sockaddr_in6::sin6_flowinfo"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_flowinfo) - 4usize];
    ["Offset of field: sockaddr_in6::sin6_addr"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_addr) - 8usize];
    ["Offset of field: sockaddr_in6::sin6_scope_id"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_scope_id) - 24usize];
};
impl Default for sockaddr_in6 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreq"][::std::mem::size_of::<ip_mreq>() - 8usize];
    ["Alignment of ip_mreq"][::std::mem::align_of::<ip_mreq>() - 4usize];
    ["Offset of field: ip_mreq::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreq, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreq::imr_interface"]
        [::std::mem::offset_of!(ip_mreq, imr_interface) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
    pub imr_sourceaddr: in_addr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_mreq_source"]
        [::std::mem::size_of::<ip_mreq_source>() - 12usize];
    ["Alignment of ip_mreq_source"]
        [::std::mem::align_of::<ip_mreq_source>() - 4usize];
    ["Offset of field: ip_mreq_source::imr_multiaddr"]
        [::std::mem::offset_of!(ip_mreq_source, imr_multiaddr) - 0usize];
    ["Offset of field: ip_mreq_source::imr_interface"]
        [::std::mem::offset_of!(ip_mreq_source, imr_interface) - 4usize];
    ["Offset of field: ip_mreq_source::imr_sourceaddr"]
        [::std::mem::offset_of!(ip_mreq_source, imr_sourceaddr) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipv6_mreq"][::std::mem::size_of::<ipv6_mreq>() - 20usize];
    ["Alignment of ipv6_mreq"][::std::mem::align_of::<ipv6_mreq>() - 4usize];
    ["Offset of field: ipv6_mreq::ipv6mr_multiaddr"]
        [::std::mem::offset_of!(ipv6_mreq, ipv6mr_multiaddr) - 0usize];
    ["Offset of field: ipv6_mreq::ipv6mr_interface"]
        [::std::mem::offset_of!(ipv6_mreq, ipv6mr_interface) - 16usize];
};
impl Default for ipv6_mreq {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_req"][::std::mem::size_of::<group_req>() - 136usize];
    ["Alignment of group_req"][::std::mem::align_of::<group_req>() - 8usize];
    ["Offset of field: group_req::gr_interface"]
        [::std::mem::offset_of!(group_req, gr_interface) - 0usize];
    ["Offset of field: group_req::gr_group"]
        [::std::mem::offset_of!(group_req, gr_group) - 8usize];
};
impl Default for group_req {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_source_req"]
        [::std::mem::size_of::<group_source_req>() - 264usize];
    ["Alignment of group_source_req"]
        [::std::mem::align_of::<group_source_req>() - 8usize];
    ["Offset of field: group_source_req::gsr_interface"]
        [::std::mem::offset_of!(group_source_req, gsr_interface) - 0usize];
    ["Offset of field: group_source_req::gsr_group"]
        [::std::mem::offset_of!(group_source_req, gsr_group) - 8usize];
    ["Offset of field: group_source_req::gsr_source"]
        [::std::mem::offset_of!(group_source_req, gsr_source) - 136usize];
};
impl Default for group_source_req {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ip_msfilter {
    pub imsf_multiaddr: in_addr,
    pub imsf_interface: in_addr,
    pub imsf_fmode: u32,
    pub imsf_numsrc: u32,
    pub imsf_slist: [in_addr; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ip_msfilter"][::std::mem::size_of::<ip_msfilter>() - 20usize];
    ["Alignment of ip_msfilter"]
        [::std::mem::align_of::<ip_msfilter>() - 4usize];
    ["Offset of field: ip_msfilter::imsf_multiaddr"]
        [::std::mem::offset_of!(ip_msfilter, imsf_multiaddr) - 0usize];
    ["Offset of field: ip_msfilter::imsf_interface"]
        [::std::mem::offset_of!(ip_msfilter, imsf_interface) - 4usize];
    ["Offset of field: ip_msfilter::imsf_fmode"]
        [::std::mem::offset_of!(ip_msfilter, imsf_fmode) - 8usize];
    ["Offset of field: ip_msfilter::imsf_numsrc"]
        [::std::mem::offset_of!(ip_msfilter, imsf_numsrc) - 12usize];
    ["Offset of field: ip_msfilter::imsf_slist"]
        [::std::mem::offset_of!(ip_msfilter, imsf_slist) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_filter {
    pub gf_interface: u32,
    pub gf_group: sockaddr_storage,
    pub gf_fmode: u32,
    pub gf_numsrc: u32,
    pub gf_slist: [sockaddr_storage; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of group_filter"][::std::mem::size_of::<group_filter>() - 272usize];
    ["Alignment of group_filter"]
        [::std::mem::align_of::<group_filter>() - 8usize];
    ["Offset of field: group_filter::gf_interface"]
        [::std::mem::offset_of!(group_filter, gf_interface) - 0usize];
    ["Offset of field: group_filter::gf_group"]
        [::std::mem::offset_of!(group_filter, gf_group) - 8usize];
    ["Offset of field: group_filter::gf_fmode"]
        [::std::mem::offset_of!(group_filter, gf_fmode) - 136usize];
    ["Offset of field: group_filter::gf_numsrc"]
        [::std::mem::offset_of!(group_filter, gf_numsrc) - 140usize];
    ["Offset of field: group_filter::gf_slist"]
        [::std::mem::offset_of!(group_filter, gf_slist) - 144usize];
};
impl Default for group_filter {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn ntohl(__netlong: u32) -> u32;
}
unsafe extern "C" {
    pub fn ntohs(__netshort: u16) -> u16;
}
unsafe extern "C" {
    pub fn htonl(__hostlong: u32) -> u32;
}
unsafe extern "C" {
    pub fn htons(__hostshort: u16) -> u16;
}
unsafe extern "C" {
    pub fn bindresvport(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bindresvport6(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in6,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet_addr(__cp: *const ::std::os::raw::c_char) -> in_addr_t;
}
unsafe extern "C" {
    pub fn inet_lnaof(__in: in_addr) -> in_addr_t;
}
unsafe extern "C" {
    pub fn inet_makeaddr(__net: in_addr_t, __host: in_addr_t) -> in_addr;
}
unsafe extern "C" {
    pub fn inet_netof(__in: in_addr) -> in_addr_t;
}
unsafe extern "C" {
    pub fn inet_network(__cp: *const ::std::os::raw::c_char) -> in_addr_t;
}
unsafe extern "C" {
    pub fn inet_ntoa(__in: in_addr) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn inet_pton(
        __af: ::std::os::raw::c_int,
        __cp: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet_ntop(
        __af: ::std::os::raw::c_int,
        __cp: *const ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __len: socklen_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn inet_aton(
        __cp: *const ::std::os::raw::c_char,
        __inp: *mut in_addr,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet_neta(
        __net: in_addr_t,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn inet_net_ntop(
        __af: ::std::os::raw::c_int,
        __cp: *const ::std::os::raw::c_void,
        __bits: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn inet_net_pton(
        __af: ::std::os::raw::c_int,
        __cp: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_void,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn inet_nsap_addr(
        __cp: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_uchar,
        __len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn inet_nsap_ntoa(
        __len: ::std::os::raw::c_int,
        __cp: *const ::std::os::raw::c_uchar,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type wchar_t = ::std::os::raw::c_int;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"]
        [::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"]
        [::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"]
        [::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"]
        [::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"]
        [::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"]
        [::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(
        __nptr: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(
        __nptr: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(
        __statebuf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"]
        [::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"]
        [::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"]
        [::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"]
        [::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
impl Default for random_data {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn random_r(
        __buf: *mut random_data,
        __result: *mut i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(
        __xsubi: *mut ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(
        __xsubi: *mut ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(
        __seed16v: *mut ::std::os::raw::c_ushort,
    ) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"]
        [::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"]
        [::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"]
        [::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"]
        [::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn malloc(
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn alloca(
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(
        __name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putenv(
        __string: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(
        __name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mktemp(
        __template: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(
        __template: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(
        __template: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn system(
        __command: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong)
        -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn div(
        __numer: ::std::os::raw::c_int,
        __denom: ::std::os::raw::c_int,
    ) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(
        __numer: ::std::os::raw::c_long,
        __denom: ::std::os::raw::c_long,
    ) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mblen(
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(
        __s: *mut ::std::os::raw::c_char,
        __wchar: wchar_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(
        __pwcs: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(
        __s: *mut ::std::os::raw::c_char,
        __pwcs: *const wchar_t,
        __n: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn rpmatch(
        __response: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getloadavg(
        __loadavg: *mut f64,
        __nelem: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"]
        [::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"]
        [::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type PCRE2_UCHAR8 = u8;
pub type PCRE2_UCHAR16 = u16;
pub type PCRE2_UCHAR32 = u32;
pub type PCRE2_SPTR8 = *const PCRE2_UCHAR8;
pub type PCRE2_SPTR16 = *const PCRE2_UCHAR16;
pub type PCRE2_SPTR32 = *const PCRE2_UCHAR32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_general_context_8 {
    _unused: [u8; 0],
}
pub type pcre2_general_context_8 = pcre2_real_general_context_8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_compile_context_8 {
    _unused: [u8; 0],
}
pub type pcre2_compile_context_8 = pcre2_real_compile_context_8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_match_context_8 {
    _unused: [u8; 0],
}
pub type pcre2_match_context_8 = pcre2_real_match_context_8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_convert_context_8 {
    _unused: [u8; 0],
}
pub type pcre2_convert_context_8 = pcre2_real_convert_context_8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_code_8 {
    _unused: [u8; 0],
}
pub type pcre2_code_8 = pcre2_real_code_8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_match_data_8 {
    _unused: [u8; 0],
}
pub type pcre2_match_data_8 = pcre2_real_match_data_8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_jit_stack_8 {
    _unused: [u8; 0],
}
pub type pcre2_jit_stack_8 = pcre2_real_jit_stack_8;
pub type pcre2_jit_callback_8 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
    ) -> *mut pcre2_jit_stack_8,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_callout_block_8 {
    pub version: u32,
    pub callout_number: u32,
    pub capture_top: u32,
    pub capture_last: u32,
    pub offset_vector: *mut usize,
    pub mark: PCRE2_SPTR8,
    pub subject: PCRE2_SPTR8,
    pub subject_length: usize,
    pub start_match: usize,
    pub current_position: usize,
    pub pattern_position: usize,
    pub next_item_length: usize,
    pub callout_string_offset: usize,
    pub callout_string_length: usize,
    pub callout_string: PCRE2_SPTR8,
    pub callout_flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre2_callout_block_8"]
        [::std::mem::size_of::<pcre2_callout_block_8>() - 112usize];
    ["Alignment of pcre2_callout_block_8"]
        [::std::mem::align_of::<pcre2_callout_block_8>() - 8usize];
    ["Offset of field: pcre2_callout_block_8::version"]
        [::std::mem::offset_of!(pcre2_callout_block_8, version) - 0usize];
    ["Offset of field: pcre2_callout_block_8::callout_number"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        callout_number
    ) - 4usize];
    ["Offset of field: pcre2_callout_block_8::capture_top"]
        [::std::mem::offset_of!(pcre2_callout_block_8, capture_top) - 8usize];
    ["Offset of field: pcre2_callout_block_8::capture_last"]
        [::std::mem::offset_of!(pcre2_callout_block_8, capture_last) - 12usize];
    ["Offset of field: pcre2_callout_block_8::offset_vector"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        offset_vector
    ) - 16usize];
    ["Offset of field: pcre2_callout_block_8::mark"]
        [::std::mem::offset_of!(pcre2_callout_block_8, mark) - 24usize];
    ["Offset of field: pcre2_callout_block_8::subject"]
        [::std::mem::offset_of!(pcre2_callout_block_8, subject) - 32usize];
    ["Offset of field: pcre2_callout_block_8::subject_length"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        subject_length
    ) - 40usize];
    ["Offset of field: pcre2_callout_block_8::start_match"]
        [::std::mem::offset_of!(pcre2_callout_block_8, start_match) - 48usize];
    ["Offset of field: pcre2_callout_block_8::current_position"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        current_position
    ) - 56usize];
    ["Offset of field: pcre2_callout_block_8::pattern_position"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        pattern_position
    ) - 64usize];
    ["Offset of field: pcre2_callout_block_8::next_item_length"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        next_item_length
    ) - 72usize];
    ["Offset of field: pcre2_callout_block_8::callout_string_offset"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        callout_string_offset
    )
        - 80usize];
    ["Offset of field: pcre2_callout_block_8::callout_string_length"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        callout_string_length
    )
        - 88usize];
    ["Offset of field: pcre2_callout_block_8::callout_string"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        callout_string
    ) - 96usize];
    ["Offset of field: pcre2_callout_block_8::callout_flags"][::std::mem::offset_of!(
        pcre2_callout_block_8,
        callout_flags
    ) - 104usize];
};
impl Default for pcre2_callout_block_8 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_callout_enumerate_block_8 {
    pub version: u32,
    pub pattern_position: usize,
    pub next_item_length: usize,
    pub callout_number: u32,
    pub callout_string_offset: usize,
    pub callout_string_length: usize,
    pub callout_string: PCRE2_SPTR8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre2_callout_enumerate_block_8"]
        [::std::mem::size_of::<pcre2_callout_enumerate_block_8>() - 56usize];
    ["Alignment of pcre2_callout_enumerate_block_8"]
        [::std::mem::align_of::<pcre2_callout_enumerate_block_8>() - 8usize];
    ["Offset of field: pcre2_callout_enumerate_block_8::version"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_8,
        version
    ) - 0usize];
    ["Offset of field: pcre2_callout_enumerate_block_8::pattern_position"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_8,
        pattern_position
    )
        - 8usize];
    ["Offset of field: pcre2_callout_enumerate_block_8::next_item_length"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_8,
        next_item_length
    )
        - 16usize];
    ["Offset of field: pcre2_callout_enumerate_block_8::callout_number"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_8,
        callout_number
    )
        - 24usize];
    ["Offset of field: pcre2_callout_enumerate_block_8::callout_string_offset"]
        [::std::mem::offset_of!(
            pcre2_callout_enumerate_block_8,
            callout_string_offset
        ) - 32usize];
    ["Offset of field: pcre2_callout_enumerate_block_8::callout_string_length"]
        [::std::mem::offset_of!(
            pcre2_callout_enumerate_block_8,
            callout_string_length
        ) - 40usize];
    ["Offset of field: pcre2_callout_enumerate_block_8::callout_string"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_8,
        callout_string
    )
        - 48usize];
};
impl Default for pcre2_callout_enumerate_block_8 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_substitute_callout_block_8 {
    pub version: u32,
    pub input: PCRE2_SPTR8,
    pub output: PCRE2_SPTR8,
    pub output_offsets: [usize; 2usize],
    pub ovector: *mut usize,
    pub oveccount: u32,
    pub subscount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre2_substitute_callout_block_8"]
        [::std::mem::size_of::<pcre2_substitute_callout_block_8>() - 56usize];
    ["Alignment of pcre2_substitute_callout_block_8"]
        [::std::mem::align_of::<pcre2_substitute_callout_block_8>() - 8usize];
    ["Offset of field: pcre2_substitute_callout_block_8::version"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_8,
        version
    ) - 0usize];
    ["Offset of field: pcre2_substitute_callout_block_8::input"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_8,
        input
    ) - 8usize];
    ["Offset of field: pcre2_substitute_callout_block_8::output"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_8,
        output
    ) - 16usize];
    ["Offset of field: pcre2_substitute_callout_block_8::output_offsets"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_8,
        output_offsets
    )
        - 24usize];
    ["Offset of field: pcre2_substitute_callout_block_8::ovector"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_8,
        ovector
    ) - 40usize];
    ["Offset of field: pcre2_substitute_callout_block_8::oveccount"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_8,
        oveccount
    )
        - 48usize];
    ["Offset of field: pcre2_substitute_callout_block_8::subscount"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_8,
        subscount
    )
        - 52usize];
};
impl Default for pcre2_substitute_callout_block_8 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn pcre2_config_8(
        arg1: u32,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_general_context_copy_8(
        arg1: *mut pcre2_general_context_8,
    ) -> *mut pcre2_general_context_8;
}
unsafe extern "C" {
    pub fn pcre2_general_context_create_8(
        arg1: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: usize,
                arg2: *mut ::std::os::raw::c_void,
            ) -> *mut ::std::os::raw::c_void,
        >,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_void,
            ),
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> *mut pcre2_general_context_8;
}
unsafe extern "C" {
    pub fn pcre2_general_context_free_8(arg1: *mut pcre2_general_context_8);
}
unsafe extern "C" {
    pub fn pcre2_compile_context_copy_8(
        arg1: *mut pcre2_compile_context_8,
    ) -> *mut pcre2_compile_context_8;
}
unsafe extern "C" {
    pub fn pcre2_compile_context_create_8(
        arg1: *mut pcre2_general_context_8,
    ) -> *mut pcre2_compile_context_8;
}
unsafe extern "C" {
    pub fn pcre2_compile_context_free_8(arg1: *mut pcre2_compile_context_8);
}
unsafe extern "C" {
    pub fn pcre2_set_bsr_8(
        arg1: *mut pcre2_compile_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_character_tables_8(
        arg1: *mut pcre2_compile_context_8,
        arg2: *const u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_compile_extra_options_8(
        arg1: *mut pcre2_compile_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_max_pattern_length_8(
        arg1: *mut pcre2_compile_context_8,
        arg2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_newline_8(
        arg1: *mut pcre2_compile_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_parens_nest_limit_8(
        arg1: *mut pcre2_compile_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_compile_recursion_guard_8(
        arg1: *mut pcre2_compile_context_8,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: u32,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_convert_context_copy_8(
        arg1: *mut pcre2_convert_context_8,
    ) -> *mut pcre2_convert_context_8;
}
unsafe extern "C" {
    pub fn pcre2_convert_context_create_8(
        arg1: *mut pcre2_general_context_8,
    ) -> *mut pcre2_convert_context_8;
}
unsafe extern "C" {
    pub fn pcre2_convert_context_free_8(arg1: *mut pcre2_convert_context_8);
}
unsafe extern "C" {
    pub fn pcre2_set_glob_escape_8(
        arg1: *mut pcre2_convert_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_glob_separator_8(
        arg1: *mut pcre2_convert_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_pattern_convert_8(
        arg1: PCRE2_SPTR8,
        arg2: usize,
        arg3: u32,
        arg4: *mut *mut PCRE2_UCHAR8,
        arg5: *mut usize,
        arg6: *mut pcre2_convert_context_8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_converted_pattern_free_8(arg1: *mut PCRE2_UCHAR8);
}
unsafe extern "C" {
    pub fn pcre2_match_context_copy_8(
        arg1: *mut pcre2_match_context_8,
    ) -> *mut pcre2_match_context_8;
}
unsafe extern "C" {
    pub fn pcre2_match_context_create_8(
        arg1: *mut pcre2_general_context_8,
    ) -> *mut pcre2_match_context_8;
}
unsafe extern "C" {
    pub fn pcre2_match_context_free_8(arg1: *mut pcre2_match_context_8);
}
unsafe extern "C" {
    pub fn pcre2_set_callout_8(
        arg1: *mut pcre2_match_context_8,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pcre2_callout_block_8,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_substitute_callout_8(
        arg1: *mut pcre2_match_context_8,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pcre2_substitute_callout_block_8,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_depth_limit_8(
        arg1: *mut pcre2_match_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_heap_limit_8(
        arg1: *mut pcre2_match_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_match_limit_8(
        arg1: *mut pcre2_match_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_offset_limit_8(
        arg1: *mut pcre2_match_context_8,
        arg2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_recursion_limit_8(
        arg1: *mut pcre2_match_context_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_recursion_memory_management_8(
        arg1: *mut pcre2_match_context_8,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: usize,
                arg2: *mut ::std::os::raw::c_void,
            ) -> *mut ::std::os::raw::c_void,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_void,
            ),
        >,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_compile_8(
        arg1: PCRE2_SPTR8,
        arg2: usize,
        arg3: u32,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut usize,
        arg6: *mut pcre2_compile_context_8,
    ) -> *mut pcre2_code_8;
}
unsafe extern "C" {
    pub fn pcre2_code_free_8(arg1: *mut pcre2_code_8);
}
unsafe extern "C" {
    pub fn pcre2_code_copy_8(arg1: *const pcre2_code_8) -> *mut pcre2_code_8;
}
unsafe extern "C" {
    pub fn pcre2_code_copy_with_tables_8(
        arg1: *const pcre2_code_8,
    ) -> *mut pcre2_code_8;
}
unsafe extern "C" {
    pub fn pcre2_pattern_info_8(
        arg1: *const pcre2_code_8,
        arg2: u32,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_callout_enumerate_8(
        arg1: *const pcre2_code_8,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pcre2_callout_enumerate_block_8,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_match_data_create_8(
        arg1: u32,
        arg2: *mut pcre2_general_context_8,
    ) -> *mut pcre2_match_data_8;
}
unsafe extern "C" {
    pub fn pcre2_match_data_create_from_pattern_8(
        arg1: *const pcre2_code_8,
        arg2: *mut pcre2_general_context_8,
    ) -> *mut pcre2_match_data_8;
}
unsafe extern "C" {
    pub fn pcre2_dfa_match_8(
        arg1: *const pcre2_code_8,
        arg2: PCRE2_SPTR8,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_8,
        arg7: *mut pcre2_match_context_8,
        arg8: *mut ::std::os::raw::c_int,
        arg9: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_match_8(
        arg1: *const pcre2_code_8,
        arg2: PCRE2_SPTR8,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_8,
        arg7: *mut pcre2_match_context_8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_match_data_free_8(arg1: *mut pcre2_match_data_8);
}
unsafe extern "C" {
    pub fn pcre2_get_mark_8(arg1: *mut pcre2_match_data_8) -> PCRE2_SPTR8;
}
unsafe extern "C" {
    pub fn pcre2_get_match_data_size_8(arg1: *mut pcre2_match_data_8) -> usize;
}
unsafe extern "C" {
    pub fn pcre2_get_ovector_count_8(arg1: *mut pcre2_match_data_8) -> u32;
}
unsafe extern "C" {
    pub fn pcre2_get_ovector_pointer_8(
        arg1: *mut pcre2_match_data_8,
    ) -> *mut usize;
}
unsafe extern "C" {
    pub fn pcre2_get_startchar_8(arg1: *mut pcre2_match_data_8) -> usize;
}
unsafe extern "C" {
    pub fn pcre2_substring_copy_byname_8(
        arg1: *mut pcre2_match_data_8,
        arg2: PCRE2_SPTR8,
        arg3: *mut PCRE2_UCHAR8,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_copy_bynumber_8(
        arg1: *mut pcre2_match_data_8,
        arg2: u32,
        arg3: *mut PCRE2_UCHAR8,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_free_8(arg1: *mut PCRE2_UCHAR8);
}
unsafe extern "C" {
    pub fn pcre2_substring_get_byname_8(
        arg1: *mut pcre2_match_data_8,
        arg2: PCRE2_SPTR8,
        arg3: *mut *mut PCRE2_UCHAR8,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_get_bynumber_8(
        arg1: *mut pcre2_match_data_8,
        arg2: u32,
        arg3: *mut *mut PCRE2_UCHAR8,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_length_byname_8(
        arg1: *mut pcre2_match_data_8,
        arg2: PCRE2_SPTR8,
        arg3: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_length_bynumber_8(
        arg1: *mut pcre2_match_data_8,
        arg2: u32,
        arg3: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_nametable_scan_8(
        arg1: *const pcre2_code_8,
        arg2: PCRE2_SPTR8,
        arg3: *mut PCRE2_SPTR8,
        arg4: *mut PCRE2_SPTR8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_number_from_name_8(
        arg1: *const pcre2_code_8,
        arg2: PCRE2_SPTR8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_list_free_8(arg1: *mut PCRE2_SPTR8);
}
unsafe extern "C" {
    pub fn pcre2_substring_list_get_8(
        arg1: *mut pcre2_match_data_8,
        arg2: *mut *mut *mut PCRE2_UCHAR8,
        arg3: *mut *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_serialize_encode_8(
        arg1: *mut *const pcre2_code_8,
        arg2: i32,
        arg3: *mut *mut u8,
        arg4: *mut usize,
        arg5: *mut pcre2_general_context_8,
    ) -> i32;
}
unsafe extern "C" {
    pub fn pcre2_serialize_decode_8(
        arg1: *mut *mut pcre2_code_8,
        arg2: i32,
        arg3: *const u8,
        arg4: *mut pcre2_general_context_8,
    ) -> i32;
}
unsafe extern "C" {
    pub fn pcre2_serialize_get_number_of_codes_8(arg1: *const u8) -> i32;
}
unsafe extern "C" {
    pub fn pcre2_serialize_free_8(arg1: *mut u8);
}
unsafe extern "C" {
    pub fn pcre2_substitute_8(
        arg1: *const pcre2_code_8,
        arg2: PCRE2_SPTR8,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_8,
        arg7: *mut pcre2_match_context_8,
        arg8: PCRE2_SPTR8,
        arg9: usize,
        arg10: *mut PCRE2_UCHAR8,
        arg11: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_jit_compile_8(
        arg1: *mut pcre2_code_8,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_jit_match_8(
        arg1: *const pcre2_code_8,
        arg2: PCRE2_SPTR8,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_8,
        arg7: *mut pcre2_match_context_8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_jit_free_unused_memory_8(arg1: *mut pcre2_general_context_8);
}
unsafe extern "C" {
    pub fn pcre2_jit_stack_create_8(
        arg1: usize,
        arg2: usize,
        arg3: *mut pcre2_general_context_8,
    ) -> *mut pcre2_jit_stack_8;
}
unsafe extern "C" {
    pub fn pcre2_jit_stack_assign_8(
        arg1: *mut pcre2_match_context_8,
        arg2: pcre2_jit_callback_8,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn pcre2_jit_stack_free_8(arg1: *mut pcre2_jit_stack_8);
}
unsafe extern "C" {
    pub fn pcre2_get_error_message_8(
        arg1: ::std::os::raw::c_int,
        arg2: *mut PCRE2_UCHAR8,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_maketables_8(arg1: *mut pcre2_general_context_8) -> *const u8;
}
unsafe extern "C" {
    pub fn pcre2_maketables_free_8(
        arg1: *mut pcre2_general_context_8,
        arg2: *const u8,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_general_context_16 {
    _unused: [u8; 0],
}
pub type pcre2_general_context_16 = pcre2_real_general_context_16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_compile_context_16 {
    _unused: [u8; 0],
}
pub type pcre2_compile_context_16 = pcre2_real_compile_context_16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_match_context_16 {
    _unused: [u8; 0],
}
pub type pcre2_match_context_16 = pcre2_real_match_context_16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_convert_context_16 {
    _unused: [u8; 0],
}
pub type pcre2_convert_context_16 = pcre2_real_convert_context_16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_code_16 {
    _unused: [u8; 0],
}
pub type pcre2_code_16 = pcre2_real_code_16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_match_data_16 {
    _unused: [u8; 0],
}
pub type pcre2_match_data_16 = pcre2_real_match_data_16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_jit_stack_16 {
    _unused: [u8; 0],
}
pub type pcre2_jit_stack_16 = pcre2_real_jit_stack_16;
pub type pcre2_jit_callback_16 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
    ) -> *mut pcre2_jit_stack_16,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_callout_block_16 {
    pub version: u32,
    pub callout_number: u32,
    pub capture_top: u32,
    pub capture_last: u32,
    pub offset_vector: *mut usize,
    pub mark: PCRE2_SPTR16,
    pub subject: PCRE2_SPTR16,
    pub subject_length: usize,
    pub start_match: usize,
    pub current_position: usize,
    pub pattern_position: usize,
    pub next_item_length: usize,
    pub callout_string_offset: usize,
    pub callout_string_length: usize,
    pub callout_string: PCRE2_SPTR16,
    pub callout_flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre2_callout_block_16"]
        [::std::mem::size_of::<pcre2_callout_block_16>() - 112usize];
    ["Alignment of pcre2_callout_block_16"]
        [::std::mem::align_of::<pcre2_callout_block_16>() - 8usize];
    ["Offset of field: pcre2_callout_block_16::version"]
        [::std::mem::offset_of!(pcre2_callout_block_16, version) - 0usize];
    ["Offset of field: pcre2_callout_block_16::callout_number"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        callout_number
    ) - 4usize];
    ["Offset of field: pcre2_callout_block_16::capture_top"]
        [::std::mem::offset_of!(pcre2_callout_block_16, capture_top) - 8usize];
    ["Offset of field: pcre2_callout_block_16::capture_last"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        capture_last
    ) - 12usize];
    ["Offset of field: pcre2_callout_block_16::offset_vector"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        offset_vector
    ) - 16usize];
    ["Offset of field: pcre2_callout_block_16::mark"]
        [::std::mem::offset_of!(pcre2_callout_block_16, mark) - 24usize];
    ["Offset of field: pcre2_callout_block_16::subject"]
        [::std::mem::offset_of!(pcre2_callout_block_16, subject) - 32usize];
    ["Offset of field: pcre2_callout_block_16::subject_length"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        subject_length
    ) - 40usize];
    ["Offset of field: pcre2_callout_block_16::start_match"]
        [::std::mem::offset_of!(pcre2_callout_block_16, start_match) - 48usize];
    ["Offset of field: pcre2_callout_block_16::current_position"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        current_position
    ) - 56usize];
    ["Offset of field: pcre2_callout_block_16::pattern_position"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        pattern_position
    ) - 64usize];
    ["Offset of field: pcre2_callout_block_16::next_item_length"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        next_item_length
    ) - 72usize];
    ["Offset of field: pcre2_callout_block_16::callout_string_offset"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        callout_string_offset
    )
        - 80usize];
    ["Offset of field: pcre2_callout_block_16::callout_string_length"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        callout_string_length
    )
        - 88usize];
    ["Offset of field: pcre2_callout_block_16::callout_string"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        callout_string
    ) - 96usize];
    ["Offset of field: pcre2_callout_block_16::callout_flags"][::std::mem::offset_of!(
        pcre2_callout_block_16,
        callout_flags
    ) - 104usize];
};
impl Default for pcre2_callout_block_16 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_callout_enumerate_block_16 {
    pub version: u32,
    pub pattern_position: usize,
    pub next_item_length: usize,
    pub callout_number: u32,
    pub callout_string_offset: usize,
    pub callout_string_length: usize,
    pub callout_string: PCRE2_SPTR16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre2_callout_enumerate_block_16"]
        [::std::mem::size_of::<pcre2_callout_enumerate_block_16>() - 56usize];
    ["Alignment of pcre2_callout_enumerate_block_16"]
        [::std::mem::align_of::<pcre2_callout_enumerate_block_16>() - 8usize];
    ["Offset of field: pcre2_callout_enumerate_block_16::version"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_16,
        version
    ) - 0usize];
    ["Offset of field: pcre2_callout_enumerate_block_16::pattern_position"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_16,
        pattern_position
    )
        - 8usize];
    ["Offset of field: pcre2_callout_enumerate_block_16::next_item_length"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_16,
        next_item_length
    )
        - 16usize];
    ["Offset of field: pcre2_callout_enumerate_block_16::callout_number"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_16,
        callout_number
    )
        - 24usize];
    [
        "Offset of field: pcre2_callout_enumerate_block_16::callout_string_offset",
    ][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_16,
        callout_string_offset
    ) - 32usize];
    [
        "Offset of field: pcre2_callout_enumerate_block_16::callout_string_length",
    ][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_16,
        callout_string_length
    ) - 40usize];
    ["Offset of field: pcre2_callout_enumerate_block_16::callout_string"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_16,
        callout_string
    )
        - 48usize];
};
impl Default for pcre2_callout_enumerate_block_16 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_substitute_callout_block_16 {
    pub version: u32,
    pub input: PCRE2_SPTR16,
    pub output: PCRE2_SPTR16,
    pub output_offsets: [usize; 2usize],
    pub ovector: *mut usize,
    pub oveccount: u32,
    pub subscount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre2_substitute_callout_block_16"]
        [::std::mem::size_of::<pcre2_substitute_callout_block_16>() - 56usize];
    ["Alignment of pcre2_substitute_callout_block_16"]
        [::std::mem::align_of::<pcre2_substitute_callout_block_16>() - 8usize];
    ["Offset of field: pcre2_substitute_callout_block_16::version"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_16,
        version
    ) - 0usize];
    ["Offset of field: pcre2_substitute_callout_block_16::input"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_16,
        input
    ) - 8usize];
    ["Offset of field: pcre2_substitute_callout_block_16::output"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_16,
        output
    ) - 16usize];
    ["Offset of field: pcre2_substitute_callout_block_16::output_offsets"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_16,
        output_offsets
    )
        - 24usize];
    ["Offset of field: pcre2_substitute_callout_block_16::ovector"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_16,
        ovector
    )
        - 40usize];
    ["Offset of field: pcre2_substitute_callout_block_16::oveccount"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_16,
        oveccount
    )
        - 48usize];
    ["Offset of field: pcre2_substitute_callout_block_16::subscount"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_16,
        subscount
    )
        - 52usize];
};
impl Default for pcre2_substitute_callout_block_16 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn pcre2_config_16(
        arg1: u32,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_general_context_copy_16(
        arg1: *mut pcre2_general_context_16,
    ) -> *mut pcre2_general_context_16;
}
unsafe extern "C" {
    pub fn pcre2_general_context_create_16(
        arg1: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: usize,
                arg2: *mut ::std::os::raw::c_void,
            ) -> *mut ::std::os::raw::c_void,
        >,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_void,
            ),
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> *mut pcre2_general_context_16;
}
unsafe extern "C" {
    pub fn pcre2_general_context_free_16(arg1: *mut pcre2_general_context_16);
}
unsafe extern "C" {
    pub fn pcre2_compile_context_copy_16(
        arg1: *mut pcre2_compile_context_16,
    ) -> *mut pcre2_compile_context_16;
}
unsafe extern "C" {
    pub fn pcre2_compile_context_create_16(
        arg1: *mut pcre2_general_context_16,
    ) -> *mut pcre2_compile_context_16;
}
unsafe extern "C" {
    pub fn pcre2_compile_context_free_16(arg1: *mut pcre2_compile_context_16);
}
unsafe extern "C" {
    pub fn pcre2_set_bsr_16(
        arg1: *mut pcre2_compile_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_character_tables_16(
        arg1: *mut pcre2_compile_context_16,
        arg2: *const u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_compile_extra_options_16(
        arg1: *mut pcre2_compile_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_max_pattern_length_16(
        arg1: *mut pcre2_compile_context_16,
        arg2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_newline_16(
        arg1: *mut pcre2_compile_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_parens_nest_limit_16(
        arg1: *mut pcre2_compile_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_compile_recursion_guard_16(
        arg1: *mut pcre2_compile_context_16,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: u32,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_convert_context_copy_16(
        arg1: *mut pcre2_convert_context_16,
    ) -> *mut pcre2_convert_context_16;
}
unsafe extern "C" {
    pub fn pcre2_convert_context_create_16(
        arg1: *mut pcre2_general_context_16,
    ) -> *mut pcre2_convert_context_16;
}
unsafe extern "C" {
    pub fn pcre2_convert_context_free_16(arg1: *mut pcre2_convert_context_16);
}
unsafe extern "C" {
    pub fn pcre2_set_glob_escape_16(
        arg1: *mut pcre2_convert_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_glob_separator_16(
        arg1: *mut pcre2_convert_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_pattern_convert_16(
        arg1: PCRE2_SPTR16,
        arg2: usize,
        arg3: u32,
        arg4: *mut *mut PCRE2_UCHAR16,
        arg5: *mut usize,
        arg6: *mut pcre2_convert_context_16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_converted_pattern_free_16(arg1: *mut PCRE2_UCHAR16);
}
unsafe extern "C" {
    pub fn pcre2_match_context_copy_16(
        arg1: *mut pcre2_match_context_16,
    ) -> *mut pcre2_match_context_16;
}
unsafe extern "C" {
    pub fn pcre2_match_context_create_16(
        arg1: *mut pcre2_general_context_16,
    ) -> *mut pcre2_match_context_16;
}
unsafe extern "C" {
    pub fn pcre2_match_context_free_16(arg1: *mut pcre2_match_context_16);
}
unsafe extern "C" {
    pub fn pcre2_set_callout_16(
        arg1: *mut pcre2_match_context_16,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pcre2_callout_block_16,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_substitute_callout_16(
        arg1: *mut pcre2_match_context_16,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pcre2_substitute_callout_block_16,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_depth_limit_16(
        arg1: *mut pcre2_match_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_heap_limit_16(
        arg1: *mut pcre2_match_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_match_limit_16(
        arg1: *mut pcre2_match_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_offset_limit_16(
        arg1: *mut pcre2_match_context_16,
        arg2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_recursion_limit_16(
        arg1: *mut pcre2_match_context_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_recursion_memory_management_16(
        arg1: *mut pcre2_match_context_16,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: usize,
                arg2: *mut ::std::os::raw::c_void,
            ) -> *mut ::std::os::raw::c_void,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_void,
            ),
        >,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_compile_16(
        arg1: PCRE2_SPTR16,
        arg2: usize,
        arg3: u32,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut usize,
        arg6: *mut pcre2_compile_context_16,
    ) -> *mut pcre2_code_16;
}
unsafe extern "C" {
    pub fn pcre2_code_free_16(arg1: *mut pcre2_code_16);
}
unsafe extern "C" {
    pub fn pcre2_code_copy_16(arg1: *const pcre2_code_16)
        -> *mut pcre2_code_16;
}
unsafe extern "C" {
    pub fn pcre2_code_copy_with_tables_16(
        arg1: *const pcre2_code_16,
    ) -> *mut pcre2_code_16;
}
unsafe extern "C" {
    pub fn pcre2_pattern_info_16(
        arg1: *const pcre2_code_16,
        arg2: u32,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_callout_enumerate_16(
        arg1: *const pcre2_code_16,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pcre2_callout_enumerate_block_16,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_match_data_create_16(
        arg1: u32,
        arg2: *mut pcre2_general_context_16,
    ) -> *mut pcre2_match_data_16;
}
unsafe extern "C" {
    pub fn pcre2_match_data_create_from_pattern_16(
        arg1: *const pcre2_code_16,
        arg2: *mut pcre2_general_context_16,
    ) -> *mut pcre2_match_data_16;
}
unsafe extern "C" {
    pub fn pcre2_dfa_match_16(
        arg1: *const pcre2_code_16,
        arg2: PCRE2_SPTR16,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_16,
        arg7: *mut pcre2_match_context_16,
        arg8: *mut ::std::os::raw::c_int,
        arg9: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_match_16(
        arg1: *const pcre2_code_16,
        arg2: PCRE2_SPTR16,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_16,
        arg7: *mut pcre2_match_context_16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_match_data_free_16(arg1: *mut pcre2_match_data_16);
}
unsafe extern "C" {
    pub fn pcre2_get_mark_16(arg1: *mut pcre2_match_data_16) -> PCRE2_SPTR16;
}
unsafe extern "C" {
    pub fn pcre2_get_match_data_size_16(
        arg1: *mut pcre2_match_data_16,
    ) -> usize;
}
unsafe extern "C" {
    pub fn pcre2_get_ovector_count_16(arg1: *mut pcre2_match_data_16) -> u32;
}
unsafe extern "C" {
    pub fn pcre2_get_ovector_pointer_16(
        arg1: *mut pcre2_match_data_16,
    ) -> *mut usize;
}
unsafe extern "C" {
    pub fn pcre2_get_startchar_16(arg1: *mut pcre2_match_data_16) -> usize;
}
unsafe extern "C" {
    pub fn pcre2_substring_copy_byname_16(
        arg1: *mut pcre2_match_data_16,
        arg2: PCRE2_SPTR16,
        arg3: *mut PCRE2_UCHAR16,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_copy_bynumber_16(
        arg1: *mut pcre2_match_data_16,
        arg2: u32,
        arg3: *mut PCRE2_UCHAR16,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_free_16(arg1: *mut PCRE2_UCHAR16);
}
unsafe extern "C" {
    pub fn pcre2_substring_get_byname_16(
        arg1: *mut pcre2_match_data_16,
        arg2: PCRE2_SPTR16,
        arg3: *mut *mut PCRE2_UCHAR16,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_get_bynumber_16(
        arg1: *mut pcre2_match_data_16,
        arg2: u32,
        arg3: *mut *mut PCRE2_UCHAR16,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_length_byname_16(
        arg1: *mut pcre2_match_data_16,
        arg2: PCRE2_SPTR16,
        arg3: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_length_bynumber_16(
        arg1: *mut pcre2_match_data_16,
        arg2: u32,
        arg3: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_nametable_scan_16(
        arg1: *const pcre2_code_16,
        arg2: PCRE2_SPTR16,
        arg3: *mut PCRE2_SPTR16,
        arg4: *mut PCRE2_SPTR16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_number_from_name_16(
        arg1: *const pcre2_code_16,
        arg2: PCRE2_SPTR16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_list_free_16(arg1: *mut PCRE2_SPTR16);
}
unsafe extern "C" {
    pub fn pcre2_substring_list_get_16(
        arg1: *mut pcre2_match_data_16,
        arg2: *mut *mut *mut PCRE2_UCHAR16,
        arg3: *mut *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_serialize_encode_16(
        arg1: *mut *const pcre2_code_16,
        arg2: i32,
        arg3: *mut *mut u8,
        arg4: *mut usize,
        arg5: *mut pcre2_general_context_16,
    ) -> i32;
}
unsafe extern "C" {
    pub fn pcre2_serialize_decode_16(
        arg1: *mut *mut pcre2_code_16,
        arg2: i32,
        arg3: *const u8,
        arg4: *mut pcre2_general_context_16,
    ) -> i32;
}
unsafe extern "C" {
    pub fn pcre2_serialize_get_number_of_codes_16(arg1: *const u8) -> i32;
}
unsafe extern "C" {
    pub fn pcre2_serialize_free_16(arg1: *mut u8);
}
unsafe extern "C" {
    pub fn pcre2_substitute_16(
        arg1: *const pcre2_code_16,
        arg2: PCRE2_SPTR16,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_16,
        arg7: *mut pcre2_match_context_16,
        arg8: PCRE2_SPTR16,
        arg9: usize,
        arg10: *mut PCRE2_UCHAR16,
        arg11: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_jit_compile_16(
        arg1: *mut pcre2_code_16,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_jit_match_16(
        arg1: *const pcre2_code_16,
        arg2: PCRE2_SPTR16,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_16,
        arg7: *mut pcre2_match_context_16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_jit_free_unused_memory_16(arg1: *mut pcre2_general_context_16);
}
unsafe extern "C" {
    pub fn pcre2_jit_stack_create_16(
        arg1: usize,
        arg2: usize,
        arg3: *mut pcre2_general_context_16,
    ) -> *mut pcre2_jit_stack_16;
}
unsafe extern "C" {
    pub fn pcre2_jit_stack_assign_16(
        arg1: *mut pcre2_match_context_16,
        arg2: pcre2_jit_callback_16,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn pcre2_jit_stack_free_16(arg1: *mut pcre2_jit_stack_16);
}
unsafe extern "C" {
    pub fn pcre2_get_error_message_16(
        arg1: ::std::os::raw::c_int,
        arg2: *mut PCRE2_UCHAR16,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_maketables_16(
        arg1: *mut pcre2_general_context_16,
    ) -> *const u8;
}
unsafe extern "C" {
    pub fn pcre2_maketables_free_16(
        arg1: *mut pcre2_general_context_16,
        arg2: *const u8,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_general_context_32 {
    _unused: [u8; 0],
}
pub type pcre2_general_context_32 = pcre2_real_general_context_32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_compile_context_32 {
    _unused: [u8; 0],
}
pub type pcre2_compile_context_32 = pcre2_real_compile_context_32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_match_context_32 {
    _unused: [u8; 0],
}
pub type pcre2_match_context_32 = pcre2_real_match_context_32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_convert_context_32 {
    _unused: [u8; 0],
}
pub type pcre2_convert_context_32 = pcre2_real_convert_context_32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_code_32 {
    _unused: [u8; 0],
}
pub type pcre2_code_32 = pcre2_real_code_32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_match_data_32 {
    _unused: [u8; 0],
}
pub type pcre2_match_data_32 = pcre2_real_match_data_32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_real_jit_stack_32 {
    _unused: [u8; 0],
}
pub type pcre2_jit_stack_32 = pcre2_real_jit_stack_32;
pub type pcre2_jit_callback_32 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
    ) -> *mut pcre2_jit_stack_32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_callout_block_32 {
    pub version: u32,
    pub callout_number: u32,
    pub capture_top: u32,
    pub capture_last: u32,
    pub offset_vector: *mut usize,
    pub mark: PCRE2_SPTR32,
    pub subject: PCRE2_SPTR32,
    pub subject_length: usize,
    pub start_match: usize,
    pub current_position: usize,
    pub pattern_position: usize,
    pub next_item_length: usize,
    pub callout_string_offset: usize,
    pub callout_string_length: usize,
    pub callout_string: PCRE2_SPTR32,
    pub callout_flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre2_callout_block_32"]
        [::std::mem::size_of::<pcre2_callout_block_32>() - 112usize];
    ["Alignment of pcre2_callout_block_32"]
        [::std::mem::align_of::<pcre2_callout_block_32>() - 8usize];
    ["Offset of field: pcre2_callout_block_32::version"]
        [::std::mem::offset_of!(pcre2_callout_block_32, version) - 0usize];
    ["Offset of field: pcre2_callout_block_32::callout_number"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        callout_number
    ) - 4usize];
    ["Offset of field: pcre2_callout_block_32::capture_top"]
        [::std::mem::offset_of!(pcre2_callout_block_32, capture_top) - 8usize];
    ["Offset of field: pcre2_callout_block_32::capture_last"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        capture_last
    ) - 12usize];
    ["Offset of field: pcre2_callout_block_32::offset_vector"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        offset_vector
    ) - 16usize];
    ["Offset of field: pcre2_callout_block_32::mark"]
        [::std::mem::offset_of!(pcre2_callout_block_32, mark) - 24usize];
    ["Offset of field: pcre2_callout_block_32::subject"]
        [::std::mem::offset_of!(pcre2_callout_block_32, subject) - 32usize];
    ["Offset of field: pcre2_callout_block_32::subject_length"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        subject_length
    ) - 40usize];
    ["Offset of field: pcre2_callout_block_32::start_match"]
        [::std::mem::offset_of!(pcre2_callout_block_32, start_match) - 48usize];
    ["Offset of field: pcre2_callout_block_32::current_position"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        current_position
    ) - 56usize];
    ["Offset of field: pcre2_callout_block_32::pattern_position"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        pattern_position
    ) - 64usize];
    ["Offset of field: pcre2_callout_block_32::next_item_length"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        next_item_length
    ) - 72usize];
    ["Offset of field: pcre2_callout_block_32::callout_string_offset"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        callout_string_offset
    )
        - 80usize];
    ["Offset of field: pcre2_callout_block_32::callout_string_length"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        callout_string_length
    )
        - 88usize];
    ["Offset of field: pcre2_callout_block_32::callout_string"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        callout_string
    ) - 96usize];
    ["Offset of field: pcre2_callout_block_32::callout_flags"][::std::mem::offset_of!(
        pcre2_callout_block_32,
        callout_flags
    ) - 104usize];
};
impl Default for pcre2_callout_block_32 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_callout_enumerate_block_32 {
    pub version: u32,
    pub pattern_position: usize,
    pub next_item_length: usize,
    pub callout_number: u32,
    pub callout_string_offset: usize,
    pub callout_string_length: usize,
    pub callout_string: PCRE2_SPTR32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre2_callout_enumerate_block_32"]
        [::std::mem::size_of::<pcre2_callout_enumerate_block_32>() - 56usize];
    ["Alignment of pcre2_callout_enumerate_block_32"]
        [::std::mem::align_of::<pcre2_callout_enumerate_block_32>() - 8usize];
    ["Offset of field: pcre2_callout_enumerate_block_32::version"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_32,
        version
    ) - 0usize];
    ["Offset of field: pcre2_callout_enumerate_block_32::pattern_position"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_32,
        pattern_position
    )
        - 8usize];
    ["Offset of field: pcre2_callout_enumerate_block_32::next_item_length"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_32,
        next_item_length
    )
        - 16usize];
    ["Offset of field: pcre2_callout_enumerate_block_32::callout_number"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_32,
        callout_number
    )
        - 24usize];
    [
        "Offset of field: pcre2_callout_enumerate_block_32::callout_string_offset",
    ][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_32,
        callout_string_offset
    ) - 32usize];
    [
        "Offset of field: pcre2_callout_enumerate_block_32::callout_string_length",
    ][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_32,
        callout_string_length
    ) - 40usize];
    ["Offset of field: pcre2_callout_enumerate_block_32::callout_string"][::std::mem::offset_of!(
        pcre2_callout_enumerate_block_32,
        callout_string
    )
        - 48usize];
};
impl Default for pcre2_callout_enumerate_block_32 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcre2_substitute_callout_block_32 {
    pub version: u32,
    pub input: PCRE2_SPTR32,
    pub output: PCRE2_SPTR32,
    pub output_offsets: [usize; 2usize],
    pub ovector: *mut usize,
    pub oveccount: u32,
    pub subscount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcre2_substitute_callout_block_32"]
        [::std::mem::size_of::<pcre2_substitute_callout_block_32>() - 56usize];
    ["Alignment of pcre2_substitute_callout_block_32"]
        [::std::mem::align_of::<pcre2_substitute_callout_block_32>() - 8usize];
    ["Offset of field: pcre2_substitute_callout_block_32::version"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_32,
        version
    ) - 0usize];
    ["Offset of field: pcre2_substitute_callout_block_32::input"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_32,
        input
    ) - 8usize];
    ["Offset of field: pcre2_substitute_callout_block_32::output"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_32,
        output
    ) - 16usize];
    ["Offset of field: pcre2_substitute_callout_block_32::output_offsets"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_32,
        output_offsets
    )
        - 24usize];
    ["Offset of field: pcre2_substitute_callout_block_32::ovector"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_32,
        ovector
    )
        - 40usize];
    ["Offset of field: pcre2_substitute_callout_block_32::oveccount"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_32,
        oveccount
    )
        - 48usize];
    ["Offset of field: pcre2_substitute_callout_block_32::subscount"][::std::mem::offset_of!(
        pcre2_substitute_callout_block_32,
        subscount
    )
        - 52usize];
};
impl Default for pcre2_substitute_callout_block_32 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn pcre2_config_32(
        arg1: u32,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_general_context_copy_32(
        arg1: *mut pcre2_general_context_32,
    ) -> *mut pcre2_general_context_32;
}
unsafe extern "C" {
    pub fn pcre2_general_context_create_32(
        arg1: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: usize,
                arg2: *mut ::std::os::raw::c_void,
            ) -> *mut ::std::os::raw::c_void,
        >,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_void,
            ),
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> *mut pcre2_general_context_32;
}
unsafe extern "C" {
    pub fn pcre2_general_context_free_32(arg1: *mut pcre2_general_context_32);
}
unsafe extern "C" {
    pub fn pcre2_compile_context_copy_32(
        arg1: *mut pcre2_compile_context_32,
    ) -> *mut pcre2_compile_context_32;
}
unsafe extern "C" {
    pub fn pcre2_compile_context_create_32(
        arg1: *mut pcre2_general_context_32,
    ) -> *mut pcre2_compile_context_32;
}
unsafe extern "C" {
    pub fn pcre2_compile_context_free_32(arg1: *mut pcre2_compile_context_32);
}
unsafe extern "C" {
    pub fn pcre2_set_bsr_32(
        arg1: *mut pcre2_compile_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_character_tables_32(
        arg1: *mut pcre2_compile_context_32,
        arg2: *const u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_compile_extra_options_32(
        arg1: *mut pcre2_compile_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_max_pattern_length_32(
        arg1: *mut pcre2_compile_context_32,
        arg2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_newline_32(
        arg1: *mut pcre2_compile_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_parens_nest_limit_32(
        arg1: *mut pcre2_compile_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_compile_recursion_guard_32(
        arg1: *mut pcre2_compile_context_32,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: u32,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_convert_context_copy_32(
        arg1: *mut pcre2_convert_context_32,
    ) -> *mut pcre2_convert_context_32;
}
unsafe extern "C" {
    pub fn pcre2_convert_context_create_32(
        arg1: *mut pcre2_general_context_32,
    ) -> *mut pcre2_convert_context_32;
}
unsafe extern "C" {
    pub fn pcre2_convert_context_free_32(arg1: *mut pcre2_convert_context_32);
}
unsafe extern "C" {
    pub fn pcre2_set_glob_escape_32(
        arg1: *mut pcre2_convert_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_glob_separator_32(
        arg1: *mut pcre2_convert_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_pattern_convert_32(
        arg1: PCRE2_SPTR32,
        arg2: usize,
        arg3: u32,
        arg4: *mut *mut PCRE2_UCHAR32,
        arg5: *mut usize,
        arg6: *mut pcre2_convert_context_32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_converted_pattern_free_32(arg1: *mut PCRE2_UCHAR32);
}
unsafe extern "C" {
    pub fn pcre2_match_context_copy_32(
        arg1: *mut pcre2_match_context_32,
    ) -> *mut pcre2_match_context_32;
}
unsafe extern "C" {
    pub fn pcre2_match_context_create_32(
        arg1: *mut pcre2_general_context_32,
    ) -> *mut pcre2_match_context_32;
}
unsafe extern "C" {
    pub fn pcre2_match_context_free_32(arg1: *mut pcre2_match_context_32);
}
unsafe extern "C" {
    pub fn pcre2_set_callout_32(
        arg1: *mut pcre2_match_context_32,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pcre2_callout_block_32,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_substitute_callout_32(
        arg1: *mut pcre2_match_context_32,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pcre2_substitute_callout_block_32,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_depth_limit_32(
        arg1: *mut pcre2_match_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_heap_limit_32(
        arg1: *mut pcre2_match_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_match_limit_32(
        arg1: *mut pcre2_match_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_offset_limit_32(
        arg1: *mut pcre2_match_context_32,
        arg2: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_recursion_limit_32(
        arg1: *mut pcre2_match_context_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_set_recursion_memory_management_32(
        arg1: *mut pcre2_match_context_32,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: usize,
                arg2: *mut ::std::os::raw::c_void,
            ) -> *mut ::std::os::raw::c_void,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_void,
            ),
        >,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_compile_32(
        arg1: PCRE2_SPTR32,
        arg2: usize,
        arg3: u32,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut usize,
        arg6: *mut pcre2_compile_context_32,
    ) -> *mut pcre2_code_32;
}
unsafe extern "C" {
    pub fn pcre2_code_free_32(arg1: *mut pcre2_code_32);
}
unsafe extern "C" {
    pub fn pcre2_code_copy_32(arg1: *const pcre2_code_32)
        -> *mut pcre2_code_32;
}
unsafe extern "C" {
    pub fn pcre2_code_copy_with_tables_32(
        arg1: *const pcre2_code_32,
    ) -> *mut pcre2_code_32;
}
unsafe extern "C" {
    pub fn pcre2_pattern_info_32(
        arg1: *const pcre2_code_32,
        arg2: u32,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_callout_enumerate_32(
        arg1: *const pcre2_code_32,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut pcre2_callout_enumerate_block_32,
                arg2: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_match_data_create_32(
        arg1: u32,
        arg2: *mut pcre2_general_context_32,
    ) -> *mut pcre2_match_data_32;
}
unsafe extern "C" {
    pub fn pcre2_match_data_create_from_pattern_32(
        arg1: *const pcre2_code_32,
        arg2: *mut pcre2_general_context_32,
    ) -> *mut pcre2_match_data_32;
}
unsafe extern "C" {
    pub fn pcre2_dfa_match_32(
        arg1: *const pcre2_code_32,
        arg2: PCRE2_SPTR32,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_32,
        arg7: *mut pcre2_match_context_32,
        arg8: *mut ::std::os::raw::c_int,
        arg9: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_match_32(
        arg1: *const pcre2_code_32,
        arg2: PCRE2_SPTR32,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_32,
        arg7: *mut pcre2_match_context_32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_match_data_free_32(arg1: *mut pcre2_match_data_32);
}
unsafe extern "C" {
    pub fn pcre2_get_mark_32(arg1: *mut pcre2_match_data_32) -> PCRE2_SPTR32;
}
unsafe extern "C" {
    pub fn pcre2_get_match_data_size_32(
        arg1: *mut pcre2_match_data_32,
    ) -> usize;
}
unsafe extern "C" {
    pub fn pcre2_get_ovector_count_32(arg1: *mut pcre2_match_data_32) -> u32;
}
unsafe extern "C" {
    pub fn pcre2_get_ovector_pointer_32(
        arg1: *mut pcre2_match_data_32,
    ) -> *mut usize;
}
unsafe extern "C" {
    pub fn pcre2_get_startchar_32(arg1: *mut pcre2_match_data_32) -> usize;
}
unsafe extern "C" {
    pub fn pcre2_substring_copy_byname_32(
        arg1: *mut pcre2_match_data_32,
        arg2: PCRE2_SPTR32,
        arg3: *mut PCRE2_UCHAR32,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_copy_bynumber_32(
        arg1: *mut pcre2_match_data_32,
        arg2: u32,
        arg3: *mut PCRE2_UCHAR32,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_free_32(arg1: *mut PCRE2_UCHAR32);
}
unsafe extern "C" {
    pub fn pcre2_substring_get_byname_32(
        arg1: *mut pcre2_match_data_32,
        arg2: PCRE2_SPTR32,
        arg3: *mut *mut PCRE2_UCHAR32,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_get_bynumber_32(
        arg1: *mut pcre2_match_data_32,
        arg2: u32,
        arg3: *mut *mut PCRE2_UCHAR32,
        arg4: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_length_byname_32(
        arg1: *mut pcre2_match_data_32,
        arg2: PCRE2_SPTR32,
        arg3: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_length_bynumber_32(
        arg1: *mut pcre2_match_data_32,
        arg2: u32,
        arg3: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_nametable_scan_32(
        arg1: *const pcre2_code_32,
        arg2: PCRE2_SPTR32,
        arg3: *mut PCRE2_SPTR32,
        arg4: *mut PCRE2_SPTR32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_number_from_name_32(
        arg1: *const pcre2_code_32,
        arg2: PCRE2_SPTR32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_substring_list_free_32(arg1: *mut PCRE2_SPTR32);
}
unsafe extern "C" {
    pub fn pcre2_substring_list_get_32(
        arg1: *mut pcre2_match_data_32,
        arg2: *mut *mut *mut PCRE2_UCHAR32,
        arg3: *mut *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_serialize_encode_32(
        arg1: *mut *const pcre2_code_32,
        arg2: i32,
        arg3: *mut *mut u8,
        arg4: *mut usize,
        arg5: *mut pcre2_general_context_32,
    ) -> i32;
}
unsafe extern "C" {
    pub fn pcre2_serialize_decode_32(
        arg1: *mut *mut pcre2_code_32,
        arg2: i32,
        arg3: *const u8,
        arg4: *mut pcre2_general_context_32,
    ) -> i32;
}
unsafe extern "C" {
    pub fn pcre2_serialize_get_number_of_codes_32(arg1: *const u8) -> i32;
}
unsafe extern "C" {
    pub fn pcre2_serialize_free_32(arg1: *mut u8);
}
unsafe extern "C" {
    pub fn pcre2_substitute_32(
        arg1: *const pcre2_code_32,
        arg2: PCRE2_SPTR32,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_32,
        arg7: *mut pcre2_match_context_32,
        arg8: PCRE2_SPTR32,
        arg9: usize,
        arg10: *mut PCRE2_UCHAR32,
        arg11: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_jit_compile_32(
        arg1: *mut pcre2_code_32,
        arg2: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_jit_match_32(
        arg1: *const pcre2_code_32,
        arg2: PCRE2_SPTR32,
        arg3: usize,
        arg4: usize,
        arg5: u32,
        arg6: *mut pcre2_match_data_32,
        arg7: *mut pcre2_match_context_32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_jit_free_unused_memory_32(arg1: *mut pcre2_general_context_32);
}
unsafe extern "C" {
    pub fn pcre2_jit_stack_create_32(
        arg1: usize,
        arg2: usize,
        arg3: *mut pcre2_general_context_32,
    ) -> *mut pcre2_jit_stack_32;
}
unsafe extern "C" {
    pub fn pcre2_jit_stack_assign_32(
        arg1: *mut pcre2_match_context_32,
        arg2: pcre2_jit_callback_32,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn pcre2_jit_stack_free_32(arg1: *mut pcre2_jit_stack_32);
}
unsafe extern "C" {
    pub fn pcre2_get_error_message_32(
        arg1: ::std::os::raw::c_int,
        arg2: *mut PCRE2_UCHAR32,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pcre2_maketables_32(
        arg1: *mut pcre2_general_context_32,
    ) -> *const u8;
}
unsafe extern "C" {
    pub fn pcre2_maketables_free_32(
        arg1: *mut pcre2_general_context_32,
        arg2: *const u8,
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"]
        [::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"][::std::mem::offset_of!(
        max_align_t,
        __clang_max_align_nonce1
    ) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"][::std::mem::offset_of!(
        max_align_t,
        __clang_max_align_nonce2
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"]
        [::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"]
        [::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"]
        [::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"]
        [::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"]
        [::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"]
        [::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"]
        [::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"]
        [::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"]
        [::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"]
        [::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"]
        [::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
impl Default for tm {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::std::mem::size_of::<itimerspec>() - 32usize];
    ["Alignment of itimerspec"][::std::mem::align_of::<itimerspec>() - 8usize];
    ["Offset of field: itimerspec::it_interval"]
        [::std::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::std::mem::offset_of!(itimerspec, it_value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"]
        [::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"]
        [::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
impl Default for __locale_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
unsafe extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getres(
        __clock_id: clockid_t,
        __res: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(
        __clock_id: clockid_t,
        __tp: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(
        __clock_id: clockid_t,
        __tp: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getcpuclockid(
        __pid: pid_t,
        __clock_id: *mut clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_gettime(
        __timerid: timer_t,
        __value: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub mod LY_DATA_TYPE {
    pub type Type = ::std::os::raw::c_uint;
    pub const LY_TYPE_UNKNOWN: Type = 0;
    pub const LY_TYPE_BINARY: Type = 1;
    pub const LY_TYPE_UINT8: Type = 2;
    pub const LY_TYPE_UINT16: Type = 3;
    pub const LY_TYPE_UINT32: Type = 4;
    pub const LY_TYPE_UINT64: Type = 5;
    pub const LY_TYPE_STRING: Type = 6;
    pub const LY_TYPE_BITS: Type = 7;
    pub const LY_TYPE_BOOL: Type = 8;
    pub const LY_TYPE_DEC64: Type = 9;
    pub const LY_TYPE_EMPTY: Type = 10;
    pub const LY_TYPE_ENUM: Type = 11;
    pub const LY_TYPE_IDENT: Type = 12;
    pub const LY_TYPE_INST: Type = 13;
    pub const LY_TYPE_LEAFREF: Type = 14;
    pub const LY_TYPE_UNION: Type = 15;
    pub const LY_TYPE_INT8: Type = 16;
    pub const LY_TYPE_INT16: Type = 17;
    pub const LY_TYPE_INT32: Type = 18;
    pub const LY_TYPE_INT64: Type = 19;
}
unsafe extern "C" {
    pub static mut ly_data_type2str: [*const ::std::os::raw::c_char; 20usize];
}
pub mod LY_VALUE_FORMAT {
    pub type Type = ::std::os::raw::c_uint;
    pub const LY_VALUE_CANON: Type = 0;
    pub const LY_VALUE_SCHEMA: Type = 1;
    pub const LY_VALUE_SCHEMA_RESOLVED: Type = 2;
    pub const LY_VALUE_XML: Type = 3;
    pub const LY_VALUE_JSON: Type = 4;
    pub const LY_VALUE_LYB: Type = 5;
    pub const LY_VALUE_STR_NS: Type = 6;
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
impl Default for __mbstate_t__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"]
        [::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
impl Default for __mbstate_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"]
        [::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"]
        [::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
impl Default for _G_fpos_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"]
        [::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"]
        [::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
impl Default for _G_fpos64_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"]
        [::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"]
        [::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"]
        [::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"]
        [::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"]
        [::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"]
        [::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"]
        [::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"]
        [::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"]
        [::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"]
        [::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"]
        [::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
impl Default for _IO_FILE {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fpos_t = __fpos_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(
        __filename: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(
        arg1: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(
        __s: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(
        __fd: ::std::os::raw::c_int,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __size: usize,
    );
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(
        __c: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(
        __w: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(
        __s: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
unsafe extern "C" {
    pub fn fgetpos(
        __stream: *mut FILE,
        __pos: *mut fpos_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(
        __stream: *mut FILE,
        __pos: *const fpos_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(
        __s: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lyxp_expr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_import {
    pub module: *mut lys_module,
    pub name: *const ::std::os::raw::c_char,
    pub prefix: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
    pub rev: [::std::os::raw::c_char; 11usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_import"][::std::mem::size_of::<lysp_import>() - 64usize];
    ["Alignment of lysp_import"]
        [::std::mem::align_of::<lysp_import>() - 8usize];
    ["Offset of field: lysp_import::module"]
        [::std::mem::offset_of!(lysp_import, module) - 0usize];
    ["Offset of field: lysp_import::name"]
        [::std::mem::offset_of!(lysp_import, name) - 8usize];
    ["Offset of field: lysp_import::prefix"]
        [::std::mem::offset_of!(lysp_import, prefix) - 16usize];
    ["Offset of field: lysp_import::dsc"]
        [::std::mem::offset_of!(lysp_import, dsc) - 24usize];
    ["Offset of field: lysp_import::ref_"]
        [::std::mem::offset_of!(lysp_import, ref_) - 32usize];
    ["Offset of field: lysp_import::exts"]
        [::std::mem::offset_of!(lysp_import, exts) - 40usize];
    ["Offset of field: lysp_import::flags"]
        [::std::mem::offset_of!(lysp_import, flags) - 48usize];
    ["Offset of field: lysp_import::rev"]
        [::std::mem::offset_of!(lysp_import, rev) - 50usize];
};
impl Default for lysp_import {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_include {
    pub submodule: *mut lysp_submodule,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub rev: [::std::os::raw::c_char; 11usize],
    pub injected: ly_bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_include"][::std::mem::size_of::<lysp_include>() - 56usize];
    ["Alignment of lysp_include"]
        [::std::mem::align_of::<lysp_include>() - 8usize];
    ["Offset of field: lysp_include::submodule"]
        [::std::mem::offset_of!(lysp_include, submodule) - 0usize];
    ["Offset of field: lysp_include::name"]
        [::std::mem::offset_of!(lysp_include, name) - 8usize];
    ["Offset of field: lysp_include::dsc"]
        [::std::mem::offset_of!(lysp_include, dsc) - 16usize];
    ["Offset of field: lysp_include::ref_"]
        [::std::mem::offset_of!(lysp_include, ref_) - 24usize];
    ["Offset of field: lysp_include::exts"]
        [::std::mem::offset_of!(lysp_include, exts) - 32usize];
    ["Offset of field: lysp_include::rev"]
        [::std::mem::offset_of!(lysp_include, rev) - 40usize];
    ["Offset of field: lysp_include::injected"]
        [::std::mem::offset_of!(lysp_include, injected) - 51usize];
};
impl Default for lysp_include {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_ext {
    pub name: *const ::std::os::raw::c_char,
    pub argname: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
    pub compiled: *mut lysc_ext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_ext"][::std::mem::size_of::<lysp_ext>() - 56usize];
    ["Alignment of lysp_ext"][::std::mem::align_of::<lysp_ext>() - 8usize];
    ["Offset of field: lysp_ext::name"]
        [::std::mem::offset_of!(lysp_ext, name) - 0usize];
    ["Offset of field: lysp_ext::argname"]
        [::std::mem::offset_of!(lysp_ext, argname) - 8usize];
    ["Offset of field: lysp_ext::dsc"]
        [::std::mem::offset_of!(lysp_ext, dsc) - 16usize];
    ["Offset of field: lysp_ext::ref_"]
        [::std::mem::offset_of!(lysp_ext, ref_) - 24usize];
    ["Offset of field: lysp_ext::exts"]
        [::std::mem::offset_of!(lysp_ext, exts) - 32usize];
    ["Offset of field: lysp_ext::flags"]
        [::std::mem::offset_of!(lysp_ext, flags) - 40usize];
    ["Offset of field: lysp_ext::compiled"]
        [::std::mem::offset_of!(lysp_ext, compiled) - 48usize];
};
impl Default for lysp_ext {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_feature {
    pub name: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub iffeatures_c: *mut lysc_iffeature,
    pub depfeatures: *mut *mut lysp_feature,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_feature"][::std::mem::size_of::<lysp_feature>() - 64usize];
    ["Alignment of lysp_feature"]
        [::std::mem::align_of::<lysp_feature>() - 8usize];
    ["Offset of field: lysp_feature::name"]
        [::std::mem::offset_of!(lysp_feature, name) - 0usize];
    ["Offset of field: lysp_feature::iffeatures"]
        [::std::mem::offset_of!(lysp_feature, iffeatures) - 8usize];
    ["Offset of field: lysp_feature::iffeatures_c"]
        [::std::mem::offset_of!(lysp_feature, iffeatures_c) - 16usize];
    ["Offset of field: lysp_feature::depfeatures"]
        [::std::mem::offset_of!(lysp_feature, depfeatures) - 24usize];
    ["Offset of field: lysp_feature::dsc"]
        [::std::mem::offset_of!(lysp_feature, dsc) - 32usize];
    ["Offset of field: lysp_feature::ref_"]
        [::std::mem::offset_of!(lysp_feature, ref_) - 40usize];
    ["Offset of field: lysp_feature::exts"]
        [::std::mem::offset_of!(lysp_feature, exts) - 48usize];
    ["Offset of field: lysp_feature::flags"]
        [::std::mem::offset_of!(lysp_feature, flags) - 56usize];
};
impl Default for lysp_feature {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysc_iffeature {
    pub expr: *mut u8,
    pub features: *mut *mut lysp_feature,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysc_iffeature"]
        [::std::mem::size_of::<lysc_iffeature>() - 16usize];
    ["Alignment of lysc_iffeature"]
        [::std::mem::align_of::<lysc_iffeature>() - 8usize];
    ["Offset of field: lysc_iffeature::expr"]
        [::std::mem::offset_of!(lysc_iffeature, expr) - 0usize];
    ["Offset of field: lysc_iffeature::features"]
        [::std::mem::offset_of!(lysc_iffeature, features) - 8usize];
};
impl Default for lysc_iffeature {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_qname {
    pub str_: *const ::std::os::raw::c_char,
    pub mod_: *const lysp_module,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_qname"][::std::mem::size_of::<lysp_qname>() - 24usize];
    ["Alignment of lysp_qname"][::std::mem::align_of::<lysp_qname>() - 8usize];
    ["Offset of field: lysp_qname::str_"]
        [::std::mem::offset_of!(lysp_qname, str_) - 0usize];
    ["Offset of field: lysp_qname::mod_"]
        [::std::mem::offset_of!(lysp_qname, mod_) - 8usize];
    ["Offset of field: lysp_qname::flags"]
        [::std::mem::offset_of!(lysp_qname, flags) - 16usize];
};
impl Default for lysp_qname {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_ident {
    pub name: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub bases: *mut *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_ident"][::std::mem::size_of::<lysp_ident>() - 56usize];
    ["Alignment of lysp_ident"][::std::mem::align_of::<lysp_ident>() - 8usize];
    ["Offset of field: lysp_ident::name"]
        [::std::mem::offset_of!(lysp_ident, name) - 0usize];
    ["Offset of field: lysp_ident::iffeatures"]
        [::std::mem::offset_of!(lysp_ident, iffeatures) - 8usize];
    ["Offset of field: lysp_ident::bases"]
        [::std::mem::offset_of!(lysp_ident, bases) - 16usize];
    ["Offset of field: lysp_ident::dsc"]
        [::std::mem::offset_of!(lysp_ident, dsc) - 24usize];
    ["Offset of field: lysp_ident::ref_"]
        [::std::mem::offset_of!(lysp_ident, ref_) - 32usize];
    ["Offset of field: lysp_ident::exts"]
        [::std::mem::offset_of!(lysp_ident, exts) - 40usize];
    ["Offset of field: lysp_ident::flags"]
        [::std::mem::offset_of!(lysp_ident, flags) - 48usize];
};
impl Default for lysp_ident {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_restr {
    pub arg: lysp_qname,
    pub emsg: *const ::std::os::raw::c_char,
    pub eapptag: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_restr"][::std::mem::size_of::<lysp_restr>() - 64usize];
    ["Alignment of lysp_restr"][::std::mem::align_of::<lysp_restr>() - 8usize];
    ["Offset of field: lysp_restr::arg"]
        [::std::mem::offset_of!(lysp_restr, arg) - 0usize];
    ["Offset of field: lysp_restr::emsg"]
        [::std::mem::offset_of!(lysp_restr, emsg) - 24usize];
    ["Offset of field: lysp_restr::eapptag"]
        [::std::mem::offset_of!(lysp_restr, eapptag) - 32usize];
    ["Offset of field: lysp_restr::dsc"]
        [::std::mem::offset_of!(lysp_restr, dsc) - 40usize];
    ["Offset of field: lysp_restr::ref_"]
        [::std::mem::offset_of!(lysp_restr, ref_) - 48usize];
    ["Offset of field: lysp_restr::exts"]
        [::std::mem::offset_of!(lysp_restr, exts) - 56usize];
};
impl Default for lysp_restr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_revision {
    pub date: [::std::os::raw::c_char; 11usize],
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_revision"][::std::mem::size_of::<lysp_revision>() - 40usize];
    ["Alignment of lysp_revision"]
        [::std::mem::align_of::<lysp_revision>() - 8usize];
    ["Offset of field: lysp_revision::date"]
        [::std::mem::offset_of!(lysp_revision, date) - 0usize];
    ["Offset of field: lysp_revision::dsc"]
        [::std::mem::offset_of!(lysp_revision, dsc) - 16usize];
    ["Offset of field: lysp_revision::ref_"]
        [::std::mem::offset_of!(lysp_revision, ref_) - 24usize];
    ["Offset of field: lysp_revision::exts"]
        [::std::mem::offset_of!(lysp_revision, exts) - 32usize];
};
impl Default for lysp_revision {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_type_enum {
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub value: i64,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_type_enum"]
        [::std::mem::size_of::<lysp_type_enum>() - 56usize];
    ["Alignment of lysp_type_enum"]
        [::std::mem::align_of::<lysp_type_enum>() - 8usize];
    ["Offset of field: lysp_type_enum::name"]
        [::std::mem::offset_of!(lysp_type_enum, name) - 0usize];
    ["Offset of field: lysp_type_enum::dsc"]
        [::std::mem::offset_of!(lysp_type_enum, dsc) - 8usize];
    ["Offset of field: lysp_type_enum::ref_"]
        [::std::mem::offset_of!(lysp_type_enum, ref_) - 16usize];
    ["Offset of field: lysp_type_enum::value"]
        [::std::mem::offset_of!(lysp_type_enum, value) - 24usize];
    ["Offset of field: lysp_type_enum::iffeatures"]
        [::std::mem::offset_of!(lysp_type_enum, iffeatures) - 32usize];
    ["Offset of field: lysp_type_enum::exts"]
        [::std::mem::offset_of!(lysp_type_enum, exts) - 40usize];
    ["Offset of field: lysp_type_enum::flags"]
        [::std::mem::offset_of!(lysp_type_enum, flags) - 48usize];
};
impl Default for lysp_type_enum {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_type {
    pub name: *const ::std::os::raw::c_char,
    pub range: *mut lysp_restr,
    pub length: *mut lysp_restr,
    pub patterns: *mut lysp_restr,
    pub enums: *mut lysp_type_enum,
    pub bits: *mut lysp_type_enum,
    pub path: *mut lyxp_expr,
    pub bases: *mut *const ::std::os::raw::c_char,
    pub types: *mut lysp_type,
    pub exts: *mut lysp_ext_instance,
    pub pmod: *const lysp_module,
    pub compiled: *mut lysc_type,
    pub fraction_digits: u8,
    pub require_instance: u8,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_type"][::std::mem::size_of::<lysp_type>() - 104usize];
    ["Alignment of lysp_type"][::std::mem::align_of::<lysp_type>() - 8usize];
    ["Offset of field: lysp_type::name"]
        [::std::mem::offset_of!(lysp_type, name) - 0usize];
    ["Offset of field: lysp_type::range"]
        [::std::mem::offset_of!(lysp_type, range) - 8usize];
    ["Offset of field: lysp_type::length"]
        [::std::mem::offset_of!(lysp_type, length) - 16usize];
    ["Offset of field: lysp_type::patterns"]
        [::std::mem::offset_of!(lysp_type, patterns) - 24usize];
    ["Offset of field: lysp_type::enums"]
        [::std::mem::offset_of!(lysp_type, enums) - 32usize];
    ["Offset of field: lysp_type::bits"]
        [::std::mem::offset_of!(lysp_type, bits) - 40usize];
    ["Offset of field: lysp_type::path"]
        [::std::mem::offset_of!(lysp_type, path) - 48usize];
    ["Offset of field: lysp_type::bases"]
        [::std::mem::offset_of!(lysp_type, bases) - 56usize];
    ["Offset of field: lysp_type::types"]
        [::std::mem::offset_of!(lysp_type, types) - 64usize];
    ["Offset of field: lysp_type::exts"]
        [::std::mem::offset_of!(lysp_type, exts) - 72usize];
    ["Offset of field: lysp_type::pmod"]
        [::std::mem::offset_of!(lysp_type, pmod) - 80usize];
    ["Offset of field: lysp_type::compiled"]
        [::std::mem::offset_of!(lysp_type, compiled) - 88usize];
    ["Offset of field: lysp_type::fraction_digits"]
        [::std::mem::offset_of!(lysp_type, fraction_digits) - 96usize];
    ["Offset of field: lysp_type::require_instance"]
        [::std::mem::offset_of!(lysp_type, require_instance) - 97usize];
    ["Offset of field: lysp_type::flags"]
        [::std::mem::offset_of!(lysp_type, flags) - 98usize];
};
impl Default for lysp_type {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_tpdf {
    pub name: *const ::std::os::raw::c_char,
    pub units: *const ::std::os::raw::c_char,
    pub dflt: lysp_qname,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
    pub type_: lysp_type,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_tpdf"][::std::mem::size_of::<lysp_tpdf>() - 176usize];
    ["Alignment of lysp_tpdf"][::std::mem::align_of::<lysp_tpdf>() - 8usize];
    ["Offset of field: lysp_tpdf::name"]
        [::std::mem::offset_of!(lysp_tpdf, name) - 0usize];
    ["Offset of field: lysp_tpdf::units"]
        [::std::mem::offset_of!(lysp_tpdf, units) - 8usize];
    ["Offset of field: lysp_tpdf::dflt"]
        [::std::mem::offset_of!(lysp_tpdf, dflt) - 16usize];
    ["Offset of field: lysp_tpdf::dsc"]
        [::std::mem::offset_of!(lysp_tpdf, dsc) - 40usize];
    ["Offset of field: lysp_tpdf::ref_"]
        [::std::mem::offset_of!(lysp_tpdf, ref_) - 48usize];
    ["Offset of field: lysp_tpdf::exts"]
        [::std::mem::offset_of!(lysp_tpdf, exts) - 56usize];
    ["Offset of field: lysp_tpdf::type_"]
        [::std::mem::offset_of!(lysp_tpdf, type_) - 64usize];
    ["Offset of field: lysp_tpdf::flags"]
        [::std::mem::offset_of!(lysp_tpdf, flags) - 168usize];
};
impl Default for lysp_tpdf {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_when {
    pub cond: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_when"][::std::mem::size_of::<lysp_when>() - 32usize];
    ["Alignment of lysp_when"][::std::mem::align_of::<lysp_when>() - 8usize];
    ["Offset of field: lysp_when::cond"]
        [::std::mem::offset_of!(lysp_when, cond) - 0usize];
    ["Offset of field: lysp_when::dsc"]
        [::std::mem::offset_of!(lysp_when, dsc) - 8usize];
    ["Offset of field: lysp_when::ref_"]
        [::std::mem::offset_of!(lysp_when, ref_) - 16usize];
    ["Offset of field: lysp_when::exts"]
        [::std::mem::offset_of!(lysp_when, exts) - 24usize];
};
impl Default for lysp_when {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_refine {
    pub nodeid: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub musts: *mut lysp_restr,
    pub presence: *const ::std::os::raw::c_char,
    pub dflts: *mut lysp_qname,
    pub min: u32,
    pub max: u32,
    pub exts: *mut lysp_ext_instance,
    pub flags: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_refine"][::std::mem::size_of::<lysp_refine>() - 80usize];
    ["Alignment of lysp_refine"]
        [::std::mem::align_of::<lysp_refine>() - 8usize];
    ["Offset of field: lysp_refine::nodeid"]
        [::std::mem::offset_of!(lysp_refine, nodeid) - 0usize];
    ["Offset of field: lysp_refine::dsc"]
        [::std::mem::offset_of!(lysp_refine, dsc) - 8usize];
    ["Offset of field: lysp_refine::ref_"]
        [::std::mem::offset_of!(lysp_refine, ref_) - 16usize];
    ["Offset of field: lysp_refine::iffeatures"]
        [::std::mem::offset_of!(lysp_refine, iffeatures) - 24usize];
    ["Offset of field: lysp_refine::musts"]
        [::std::mem::offset_of!(lysp_refine, musts) - 32usize];
    ["Offset of field: lysp_refine::presence"]
        [::std::mem::offset_of!(lysp_refine, presence) - 40usize];
    ["Offset of field: lysp_refine::dflts"]
        [::std::mem::offset_of!(lysp_refine, dflts) - 48usize];
    ["Offset of field: lysp_refine::min"]
        [::std::mem::offset_of!(lysp_refine, min) - 56usize];
    ["Offset of field: lysp_refine::max"]
        [::std::mem::offset_of!(lysp_refine, max) - 60usize];
    ["Offset of field: lysp_refine::exts"]
        [::std::mem::offset_of!(lysp_refine, exts) - 64usize];
    ["Offset of field: lysp_refine::flags"]
        [::std::mem::offset_of!(lysp_refine, flags) - 72usize];
};
impl Default for lysp_refine {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviate {
    pub mod_: u8,
    pub next: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviate"][::std::mem::size_of::<lysp_deviate>() - 24usize];
    ["Alignment of lysp_deviate"]
        [::std::mem::align_of::<lysp_deviate>() - 8usize];
    ["Offset of field: lysp_deviate::mod_"]
        [::std::mem::offset_of!(lysp_deviate, mod_) - 0usize];
    ["Offset of field: lysp_deviate::next"]
        [::std::mem::offset_of!(lysp_deviate, next) - 8usize];
    ["Offset of field: lysp_deviate::exts"]
        [::std::mem::offset_of!(lysp_deviate, exts) - 16usize];
};
impl Default for lysp_deviate {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviate_add {
    pub mod_: u8,
    pub next: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
    pub units: *const ::std::os::raw::c_char,
    pub musts: *mut lysp_restr,
    pub uniques: *mut lysp_qname,
    pub dflts: *mut lysp_qname,
    pub flags: u16,
    pub min: u32,
    pub max: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviate_add"]
        [::std::mem::size_of::<lysp_deviate_add>() - 72usize];
    ["Alignment of lysp_deviate_add"]
        [::std::mem::align_of::<lysp_deviate_add>() - 8usize];
    ["Offset of field: lysp_deviate_add::mod_"]
        [::std::mem::offset_of!(lysp_deviate_add, mod_) - 0usize];
    ["Offset of field: lysp_deviate_add::next"]
        [::std::mem::offset_of!(lysp_deviate_add, next) - 8usize];
    ["Offset of field: lysp_deviate_add::exts"]
        [::std::mem::offset_of!(lysp_deviate_add, exts) - 16usize];
    ["Offset of field: lysp_deviate_add::units"]
        [::std::mem::offset_of!(lysp_deviate_add, units) - 24usize];
    ["Offset of field: lysp_deviate_add::musts"]
        [::std::mem::offset_of!(lysp_deviate_add, musts) - 32usize];
    ["Offset of field: lysp_deviate_add::uniques"]
        [::std::mem::offset_of!(lysp_deviate_add, uniques) - 40usize];
    ["Offset of field: lysp_deviate_add::dflts"]
        [::std::mem::offset_of!(lysp_deviate_add, dflts) - 48usize];
    ["Offset of field: lysp_deviate_add::flags"]
        [::std::mem::offset_of!(lysp_deviate_add, flags) - 56usize];
    ["Offset of field: lysp_deviate_add::min"]
        [::std::mem::offset_of!(lysp_deviate_add, min) - 60usize];
    ["Offset of field: lysp_deviate_add::max"]
        [::std::mem::offset_of!(lysp_deviate_add, max) - 64usize];
};
impl Default for lysp_deviate_add {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviate_del {
    pub mod_: u8,
    pub next: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
    pub units: *const ::std::os::raw::c_char,
    pub musts: *mut lysp_restr,
    pub uniques: *mut lysp_qname,
    pub dflts: *mut lysp_qname,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviate_del"]
        [::std::mem::size_of::<lysp_deviate_del>() - 56usize];
    ["Alignment of lysp_deviate_del"]
        [::std::mem::align_of::<lysp_deviate_del>() - 8usize];
    ["Offset of field: lysp_deviate_del::mod_"]
        [::std::mem::offset_of!(lysp_deviate_del, mod_) - 0usize];
    ["Offset of field: lysp_deviate_del::next"]
        [::std::mem::offset_of!(lysp_deviate_del, next) - 8usize];
    ["Offset of field: lysp_deviate_del::exts"]
        [::std::mem::offset_of!(lysp_deviate_del, exts) - 16usize];
    ["Offset of field: lysp_deviate_del::units"]
        [::std::mem::offset_of!(lysp_deviate_del, units) - 24usize];
    ["Offset of field: lysp_deviate_del::musts"]
        [::std::mem::offset_of!(lysp_deviate_del, musts) - 32usize];
    ["Offset of field: lysp_deviate_del::uniques"]
        [::std::mem::offset_of!(lysp_deviate_del, uniques) - 40usize];
    ["Offset of field: lysp_deviate_del::dflts"]
        [::std::mem::offset_of!(lysp_deviate_del, dflts) - 48usize];
};
impl Default for lysp_deviate_del {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviate_rpl {
    pub mod_: u8,
    pub next: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
    pub type_: *mut lysp_type,
    pub units: *const ::std::os::raw::c_char,
    pub dflt: lysp_qname,
    pub flags: u16,
    pub min: u32,
    pub max: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviate_rpl"]
        [::std::mem::size_of::<lysp_deviate_rpl>() - 80usize];
    ["Alignment of lysp_deviate_rpl"]
        [::std::mem::align_of::<lysp_deviate_rpl>() - 8usize];
    ["Offset of field: lysp_deviate_rpl::mod_"]
        [::std::mem::offset_of!(lysp_deviate_rpl, mod_) - 0usize];
    ["Offset of field: lysp_deviate_rpl::next"]
        [::std::mem::offset_of!(lysp_deviate_rpl, next) - 8usize];
    ["Offset of field: lysp_deviate_rpl::exts"]
        [::std::mem::offset_of!(lysp_deviate_rpl, exts) - 16usize];
    ["Offset of field: lysp_deviate_rpl::type_"]
        [::std::mem::offset_of!(lysp_deviate_rpl, type_) - 24usize];
    ["Offset of field: lysp_deviate_rpl::units"]
        [::std::mem::offset_of!(lysp_deviate_rpl, units) - 32usize];
    ["Offset of field: lysp_deviate_rpl::dflt"]
        [::std::mem::offset_of!(lysp_deviate_rpl, dflt) - 40usize];
    ["Offset of field: lysp_deviate_rpl::flags"]
        [::std::mem::offset_of!(lysp_deviate_rpl, flags) - 64usize];
    ["Offset of field: lysp_deviate_rpl::min"]
        [::std::mem::offset_of!(lysp_deviate_rpl, min) - 68usize];
    ["Offset of field: lysp_deviate_rpl::max"]
        [::std::mem::offset_of!(lysp_deviate_rpl, max) - 72usize];
};
impl Default for lysp_deviate_rpl {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_deviation {
    pub nodeid: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub deviates: *mut lysp_deviate,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_deviation"]
        [::std::mem::size_of::<lysp_deviation>() - 40usize];
    ["Alignment of lysp_deviation"]
        [::std::mem::align_of::<lysp_deviation>() - 8usize];
    ["Offset of field: lysp_deviation::nodeid"]
        [::std::mem::offset_of!(lysp_deviation, nodeid) - 0usize];
    ["Offset of field: lysp_deviation::dsc"]
        [::std::mem::offset_of!(lysp_deviation, dsc) - 8usize];
    ["Offset of field: lysp_deviation::ref_"]
        [::std::mem::offset_of!(lysp_deviation, ref_) - 16usize];
    ["Offset of field: lysp_deviation::deviates"]
        [::std::mem::offset_of!(lysp_deviation, deviates) - 24usize];
    ["Offset of field: lysp_deviation::exts"]
        [::std::mem::offset_of!(lysp_deviation, exts) - 32usize];
};
impl Default for lysp_deviation {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node"][::std::mem::size_of::<lysp_node>() - 64usize];
    ["Alignment of lysp_node"][::std::mem::align_of::<lysp_node>() - 8usize];
    ["Offset of field: lysp_node::parent"]
        [::std::mem::offset_of!(lysp_node, parent) - 0usize];
    ["Offset of field: lysp_node::nodetype"]
        [::std::mem::offset_of!(lysp_node, nodetype) - 8usize];
    ["Offset of field: lysp_node::flags"]
        [::std::mem::offset_of!(lysp_node, flags) - 10usize];
    ["Offset of field: lysp_node::next"]
        [::std::mem::offset_of!(lysp_node, next) - 16usize];
    ["Offset of field: lysp_node::name"]
        [::std::mem::offset_of!(lysp_node, name) - 24usize];
    ["Offset of field: lysp_node::dsc"]
        [::std::mem::offset_of!(lysp_node, dsc) - 32usize];
    ["Offset of field: lysp_node::ref_"]
        [::std::mem::offset_of!(lysp_node, ref_) - 40usize];
    ["Offset of field: lysp_node::iffeatures"]
        [::std::mem::offset_of!(lysp_node, iffeatures) - 48usize];
    ["Offset of field: lysp_node::exts"]
        [::std::mem::offset_of!(lysp_node, exts) - 56usize];
};
impl Default for lysp_node {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_container {
    pub __bindgen_anon_1: lysp_node_container__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
    pub presence: *const ::std::os::raw::c_char,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
    pub actions: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_container__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_container__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_container__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_container__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_container__bindgen_ty_1__bindgen_ty_1>(
        ) - 64usize];
    ["Alignment of lysp_node_container__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_container__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    [
        "Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::parent",
    ][::std::mem::offset_of!(
        lysp_node_container__bindgen_ty_1__bindgen_ty_1,
        parent
    ) - 0usize];
    [
        "Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::nodetype",
    ][::std::mem::offset_of!(
        lysp_node_container__bindgen_ty_1__bindgen_ty_1,
        nodetype
    ) - 8usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(
            lysp_node_container__bindgen_ty_1__bindgen_ty_1,
            flags
        ) - 10usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::next"]
        [::std::mem::offset_of!(
            lysp_node_container__bindgen_ty_1__bindgen_ty_1,
            next
        ) - 16usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::name"]
        [::std::mem::offset_of!(
            lysp_node_container__bindgen_ty_1__bindgen_ty_1,
            name
        ) - 24usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_container__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::ref_"]
        [::std::mem::offset_of!(
            lysp_node_container__bindgen_ty_1__bindgen_ty_1,
            ref_
        ) - 40usize];
    [
        "Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::iffeatures",
    ][::std::mem::offset_of!(
        lysp_node_container__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1__bindgen_ty_1::exts"]
        [::std::mem::offset_of!(
            lysp_node_container__bindgen_ty_1__bindgen_ty_1,
            exts
        ) - 56usize];
};
impl Default for lysp_node_container__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_container__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_container__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_container__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_container__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_container__bindgen_ty_1::node"][::std::mem::offset_of!(
        lysp_node_container__bindgen_ty_1,
        node
    ) - 0usize];
};
impl Default for lysp_node_container__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_container"]
        [::std::mem::size_of::<lysp_node_container>() - 128usize];
    ["Alignment of lysp_node_container"]
        [::std::mem::align_of::<lysp_node_container>() - 8usize];
    ["Offset of field: lysp_node_container::musts"]
        [::std::mem::offset_of!(lysp_node_container, musts) - 64usize];
    ["Offset of field: lysp_node_container::when"]
        [::std::mem::offset_of!(lysp_node_container, when) - 72usize];
    ["Offset of field: lysp_node_container::presence"]
        [::std::mem::offset_of!(lysp_node_container, presence) - 80usize];
    ["Offset of field: lysp_node_container::typedefs"]
        [::std::mem::offset_of!(lysp_node_container, typedefs) - 88usize];
    ["Offset of field: lysp_node_container::groupings"]
        [::std::mem::offset_of!(lysp_node_container, groupings) - 96usize];
    ["Offset of field: lysp_node_container::child"]
        [::std::mem::offset_of!(lysp_node_container, child) - 104usize];
    ["Offset of field: lysp_node_container::actions"]
        [::std::mem::offset_of!(lysp_node_container, actions) - 112usize];
    ["Offset of field: lysp_node_container::notifs"]
        [::std::mem::offset_of!(lysp_node_container, notifs) - 120usize];
};
impl Default for lysp_node_container {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_leaf {
    pub __bindgen_anon_1: lysp_node_leaf__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
    pub type_: lysp_type,
    pub units: *const ::std::os::raw::c_char,
    pub dflt: lysp_qname,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_leaf__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_leaf__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaf__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
    >() - 64usize];
    ["Alignment of lysp_node_leaf__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_leaf__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
        parent
    )
        - 0usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::nodetype"][::std::mem::offset_of!(
        lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
        nodetype
    )
        - 8usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(
            lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
            iffeatures
        ) - 48usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_leaf__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_leaf__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaf__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_leaf__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_leaf__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_leaf__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_leaf__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_leaf__bindgen_ty_1, node) - 0usize];
};
impl Default for lysp_node_leaf__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaf"]
        [::std::mem::size_of::<lysp_node_leaf>() - 216usize];
    ["Alignment of lysp_node_leaf"]
        [::std::mem::align_of::<lysp_node_leaf>() - 8usize];
    ["Offset of field: lysp_node_leaf::musts"]
        [::std::mem::offset_of!(lysp_node_leaf, musts) - 64usize];
    ["Offset of field: lysp_node_leaf::when"]
        [::std::mem::offset_of!(lysp_node_leaf, when) - 72usize];
    ["Offset of field: lysp_node_leaf::type_"]
        [::std::mem::offset_of!(lysp_node_leaf, type_) - 80usize];
    ["Offset of field: lysp_node_leaf::units"]
        [::std::mem::offset_of!(lysp_node_leaf, units) - 184usize];
    ["Offset of field: lysp_node_leaf::dflt"]
        [::std::mem::offset_of!(lysp_node_leaf, dflt) - 192usize];
};
impl Default for lysp_node_leaf {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_leaflist {
    pub __bindgen_anon_1: lysp_node_leaflist__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
    pub type_: lysp_type,
    pub units: *const ::std::os::raw::c_char,
    pub dflts: *mut lysp_qname,
    pub min: u32,
    pub max: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_leaflist__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1>(
        ) - 64usize];
    ["Alignment of lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(
            lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
            parent
        ) - 0usize];
    [
        "Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::nodetype",
    ][::std::mem::offset_of!(
        lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
        nodetype
    ) - 8usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(
            lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
            flags
        ) - 10usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    [
        "Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::iffeatures",
    ][::std::mem::offset_of!(
        lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_leaflist__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaflist__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_leaflist__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_leaflist__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_leaflist__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_leaflist__bindgen_ty_1::node"][::std::mem::offset_of!(
        lysp_node_leaflist__bindgen_ty_1,
        node
    ) - 0usize];
};
impl Default for lysp_node_leaflist__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_leaflist"]
        [::std::mem::size_of::<lysp_node_leaflist>() - 208usize];
    ["Alignment of lysp_node_leaflist"]
        [::std::mem::align_of::<lysp_node_leaflist>() - 8usize];
    ["Offset of field: lysp_node_leaflist::musts"]
        [::std::mem::offset_of!(lysp_node_leaflist, musts) - 64usize];
    ["Offset of field: lysp_node_leaflist::when"]
        [::std::mem::offset_of!(lysp_node_leaflist, when) - 72usize];
    ["Offset of field: lysp_node_leaflist::type_"]
        [::std::mem::offset_of!(lysp_node_leaflist, type_) - 80usize];
    ["Offset of field: lysp_node_leaflist::units"]
        [::std::mem::offset_of!(lysp_node_leaflist, units) - 184usize];
    ["Offset of field: lysp_node_leaflist::dflts"]
        [::std::mem::offset_of!(lysp_node_leaflist, dflts) - 192usize];
    ["Offset of field: lysp_node_leaflist::min"]
        [::std::mem::offset_of!(lysp_node_leaflist, min) - 200usize];
    ["Offset of field: lysp_node_leaflist::max"]
        [::std::mem::offset_of!(lysp_node_leaflist, max) - 204usize];
};
impl Default for lysp_node_leaflist {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_list {
    pub __bindgen_anon_1: lysp_node_list__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
    pub key: *const ::std::os::raw::c_char,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
    pub actions: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
    pub uniques: *mut lysp_qname,
    pub min: u32,
    pub max: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_list__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_list__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_list__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_list__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        lysp_node_list__bindgen_ty_1__bindgen_ty_1,
    >() - 64usize];
    ["Alignment of lysp_node_list__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_list__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysp_node_list__bindgen_ty_1__bindgen_ty_1,
        parent
    )
        - 0usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::nodetype"][::std::mem::offset_of!(
        lysp_node_list__bindgen_ty_1__bindgen_ty_1,
        nodetype
    )
        - 8usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_list__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_list__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_list__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_list__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_list__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(
            lysp_node_list__bindgen_ty_1__bindgen_ty_1,
            iffeatures
        ) - 48usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_list__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_list__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_list__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_list__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_list__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_list__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_list__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_list__bindgen_ty_1, node) - 0usize];
};
impl Default for lysp_node_list__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_list"]
        [::std::mem::size_of::<lysp_node_list>() - 144usize];
    ["Alignment of lysp_node_list"]
        [::std::mem::align_of::<lysp_node_list>() - 8usize];
    ["Offset of field: lysp_node_list::musts"]
        [::std::mem::offset_of!(lysp_node_list, musts) - 64usize];
    ["Offset of field: lysp_node_list::when"]
        [::std::mem::offset_of!(lysp_node_list, when) - 72usize];
    ["Offset of field: lysp_node_list::key"]
        [::std::mem::offset_of!(lysp_node_list, key) - 80usize];
    ["Offset of field: lysp_node_list::typedefs"]
        [::std::mem::offset_of!(lysp_node_list, typedefs) - 88usize];
    ["Offset of field: lysp_node_list::groupings"]
        [::std::mem::offset_of!(lysp_node_list, groupings) - 96usize];
    ["Offset of field: lysp_node_list::child"]
        [::std::mem::offset_of!(lysp_node_list, child) - 104usize];
    ["Offset of field: lysp_node_list::actions"]
        [::std::mem::offset_of!(lysp_node_list, actions) - 112usize];
    ["Offset of field: lysp_node_list::notifs"]
        [::std::mem::offset_of!(lysp_node_list, notifs) - 120usize];
    ["Offset of field: lysp_node_list::uniques"]
        [::std::mem::offset_of!(lysp_node_list, uniques) - 128usize];
    ["Offset of field: lysp_node_list::min"]
        [::std::mem::offset_of!(lysp_node_list, min) - 136usize];
    ["Offset of field: lysp_node_list::max"]
        [::std::mem::offset_of!(lysp_node_list, max) - 140usize];
};
impl Default for lysp_node_list {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_choice {
    pub __bindgen_anon_1: lysp_node_choice__bindgen_ty_1,
    pub child: *mut lysp_node,
    pub when: *mut lysp_when,
    pub dflt: lysp_qname,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_choice__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_choice__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_choice__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
    >() - 64usize];
    ["Alignment of lysp_node_choice__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_choice__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
        parent
    )
        - 0usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(
            lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
            nodetype
        ) - 8usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    [
        "Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::iffeatures",
    ][::std::mem::offset_of!(
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_choice__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_choice__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_choice__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_choice__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_choice__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_choice__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_choice__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_choice__bindgen_ty_1, node) - 0usize];
};
impl Default for lysp_node_choice__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_choice"]
        [::std::mem::size_of::<lysp_node_choice>() - 104usize];
    ["Alignment of lysp_node_choice"]
        [::std::mem::align_of::<lysp_node_choice>() - 8usize];
    ["Offset of field: lysp_node_choice::child"]
        [::std::mem::offset_of!(lysp_node_choice, child) - 64usize];
    ["Offset of field: lysp_node_choice::when"]
        [::std::mem::offset_of!(lysp_node_choice, when) - 72usize];
    ["Offset of field: lysp_node_choice::dflt"]
        [::std::mem::offset_of!(lysp_node_choice, dflt) - 80usize];
};
impl Default for lysp_node_choice {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_case {
    pub __bindgen_anon_1: lysp_node_case__bindgen_ty_1,
    pub child: *mut lysp_node,
    pub when: *mut lysp_when,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_case__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_case__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_case__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_case__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        lysp_node_case__bindgen_ty_1__bindgen_ty_1,
    >() - 64usize];
    ["Alignment of lysp_node_case__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_case__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysp_node_case__bindgen_ty_1__bindgen_ty_1,
        parent
    )
        - 0usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::nodetype"][::std::mem::offset_of!(
        lysp_node_case__bindgen_ty_1__bindgen_ty_1,
        nodetype
    )
        - 8usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_case__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_case__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_case__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_case__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_case__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(
            lysp_node_case__bindgen_ty_1__bindgen_ty_1,
            iffeatures
        ) - 48usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_case__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_case__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_case__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_case__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_case__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_case__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_case__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_case__bindgen_ty_1, node) - 0usize];
};
impl Default for lysp_node_case__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_case"]
        [::std::mem::size_of::<lysp_node_case>() - 80usize];
    ["Alignment of lysp_node_case"]
        [::std::mem::align_of::<lysp_node_case>() - 8usize];
    ["Offset of field: lysp_node_case::child"]
        [::std::mem::offset_of!(lysp_node_case, child) - 64usize];
    ["Offset of field: lysp_node_case::when"]
        [::std::mem::offset_of!(lysp_node_case, when) - 72usize];
};
impl Default for lysp_node_case {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_anydata {
    pub __bindgen_anon_1: lysp_node_anydata__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub when: *mut lysp_when,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_anydata__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_anydata__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_anydata__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_anydata__bindgen_ty_1__bindgen_ty_1>(
        ) - 64usize];
    ["Alignment of lysp_node_anydata__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_anydata__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(
            lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
            parent
        ) - 0usize];
    [
        "Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::nodetype",
    ][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
        nodetype
    ) - 8usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    [
        "Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::iffeatures",
    ][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_anydata__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_anydata__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_anydata__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_anydata__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_anydata__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_anydata__bindgen_ty_1::node"][::std::mem::offset_of!(
        lysp_node_anydata__bindgen_ty_1,
        node
    ) - 0usize];
};
impl Default for lysp_node_anydata__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_anydata"]
        [::std::mem::size_of::<lysp_node_anydata>() - 80usize];
    ["Alignment of lysp_node_anydata"]
        [::std::mem::align_of::<lysp_node_anydata>() - 8usize];
    ["Offset of field: lysp_node_anydata::musts"]
        [::std::mem::offset_of!(lysp_node_anydata, musts) - 64usize];
    ["Offset of field: lysp_node_anydata::when"]
        [::std::mem::offset_of!(lysp_node_anydata, when) - 72usize];
};
impl Default for lysp_node_anydata {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_uses {
    pub __bindgen_anon_1: lysp_node_uses__bindgen_ty_1,
    pub refines: *mut lysp_refine,
    pub augments: *mut lysp_node_augment,
    pub when: *mut lysp_when,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_uses__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_uses__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_uses__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
    >() - 64usize];
    ["Alignment of lysp_node_uses__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_uses__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
        parent
    )
        - 0usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::nodetype"][::std::mem::offset_of!(
        lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
        nodetype
    )
        - 8usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(
            lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
            iffeatures
        ) - 48usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_uses__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_uses__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_uses__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_uses__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_uses__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_uses__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_uses__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_uses__bindgen_ty_1, node) - 0usize];
};
impl Default for lysp_node_uses__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_uses"]
        [::std::mem::size_of::<lysp_node_uses>() - 88usize];
    ["Alignment of lysp_node_uses"]
        [::std::mem::align_of::<lysp_node_uses>() - 8usize];
    ["Offset of field: lysp_node_uses::refines"]
        [::std::mem::offset_of!(lysp_node_uses, refines) - 64usize];
    ["Offset of field: lysp_node_uses::augments"]
        [::std::mem::offset_of!(lysp_node_uses, augments) - 72usize];
    ["Offset of field: lysp_node_uses::when"]
        [::std::mem::offset_of!(lysp_node_uses, when) - 80usize];
};
impl Default for lysp_node_uses {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_action_inout {
    pub __bindgen_anon_1: lysp_node_action_inout__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_action_inout__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<
            lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        >() - 64usize];
    ["Alignment of lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<
            lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        >() - 8usize];
    [
        "Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::parent",
    ][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        parent
    ) - 0usize];
    [
        "Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::nodetype",
    ][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        nodetype
    ) - 8usize];
    [
        "Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::flags",
    ][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        flags
    ) - 10usize];
    [
        "Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::next",
    ][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        next
    ) - 16usize];
    [
        "Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::name",
    ][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        name
    ) - 24usize];
    [
        "Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::dsc",
    ][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        dsc
    ) - 32usize];
    [
        "Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::ref_",
    ][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        ref_
    ) - 40usize];
    [
        "Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::iffeatures",
    ][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    [
        "Offset of field: lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1::exts",
    ][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1,
        exts
    ) - 56usize];
};
impl Default for lysp_node_action_inout__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action_inout__bindgen_ty_1"][::std::mem::size_of::<
        lysp_node_action_inout__bindgen_ty_1,
    >() - 64usize];
    ["Alignment of lysp_node_action_inout__bindgen_ty_1"][::std::mem::align_of::<
        lysp_node_action_inout__bindgen_ty_1,
    >() - 8usize];
    ["Offset of field: lysp_node_action_inout__bindgen_ty_1::node"][::std::mem::offset_of!(
        lysp_node_action_inout__bindgen_ty_1,
        node
    ) - 0usize];
};
impl Default for lysp_node_action_inout__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action_inout"]
        [::std::mem::size_of::<lysp_node_action_inout>() - 96usize];
    ["Alignment of lysp_node_action_inout"]
        [::std::mem::align_of::<lysp_node_action_inout>() - 8usize];
    ["Offset of field: lysp_node_action_inout::musts"]
        [::std::mem::offset_of!(lysp_node_action_inout, musts) - 64usize];
    ["Offset of field: lysp_node_action_inout::typedefs"]
        [::std::mem::offset_of!(lysp_node_action_inout, typedefs) - 72usize];
    ["Offset of field: lysp_node_action_inout::groupings"]
        [::std::mem::offset_of!(lysp_node_action_inout, groupings) - 80usize];
    ["Offset of field: lysp_node_action_inout::child"]
        [::std::mem::offset_of!(lysp_node_action_inout, child) - 88usize];
};
impl Default for lysp_node_action_inout {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_action {
    pub __bindgen_anon_1: lysp_node_action__bindgen_ty_1,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub input: lysp_node_action_inout,
    pub output: lysp_node_action_inout,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_action__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_action__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_action__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node_action,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
    >() - 64usize];
    ["Alignment of lysp_node_action__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_action__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
        parent
    )
        - 0usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(
            lysp_node_action__bindgen_ty_1__bindgen_ty_1,
            nodetype
        ) - 8usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    [
        "Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::iffeatures",
    ][::std::mem::offset_of!(
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_action__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_action__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_action__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_action__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_action__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_action__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_action__bindgen_ty_1, node) - 0usize];
};
impl Default for lysp_node_action__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_action"]
        [::std::mem::size_of::<lysp_node_action>() - 272usize];
    ["Alignment of lysp_node_action"]
        [::std::mem::align_of::<lysp_node_action>() - 8usize];
    ["Offset of field: lysp_node_action::typedefs"]
        [::std::mem::offset_of!(lysp_node_action, typedefs) - 64usize];
    ["Offset of field: lysp_node_action::groupings"]
        [::std::mem::offset_of!(lysp_node_action, groupings) - 72usize];
    ["Offset of field: lysp_node_action::input"]
        [::std::mem::offset_of!(lysp_node_action, input) - 80usize];
    ["Offset of field: lysp_node_action::output"]
        [::std::mem::offset_of!(lysp_node_action, output) - 176usize];
};
impl Default for lysp_node_action {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_notif {
    pub __bindgen_anon_1: lysp_node_notif__bindgen_ty_1,
    pub musts: *mut lysp_restr,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_notif__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_notif__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node_notif,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_notif__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
    >() - 64usize];
    ["Alignment of lysp_node_notif__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_notif__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
        parent
    )
        - 0usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::nodetype"]
        [::std::mem::offset_of!(
            lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
            nodetype
        ) - 8usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    [
        "Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::iffeatures",
    ][::std::mem::offset_of!(
        lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_notif__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_notif__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_notif__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_notif__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_notif__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_notif__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_notif__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_notif__bindgen_ty_1, node) - 0usize];
};
impl Default for lysp_node_notif__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_notif"]
        [::std::mem::size_of::<lysp_node_notif>() - 96usize];
    ["Alignment of lysp_node_notif"]
        [::std::mem::align_of::<lysp_node_notif>() - 8usize];
    ["Offset of field: lysp_node_notif::musts"]
        [::std::mem::offset_of!(lysp_node_notif, musts) - 64usize];
    ["Offset of field: lysp_node_notif::typedefs"]
        [::std::mem::offset_of!(lysp_node_notif, typedefs) - 72usize];
    ["Offset of field: lysp_node_notif::groupings"]
        [::std::mem::offset_of!(lysp_node_notif, groupings) - 80usize];
    ["Offset of field: lysp_node_notif::child"]
        [::std::mem::offset_of!(lysp_node_notif, child) - 88usize];
};
impl Default for lysp_node_notif {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_grp {
    pub __bindgen_anon_1: lysp_node_grp__bindgen_ty_1,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub child: *mut lysp_node,
    pub actions: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_grp__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_grp__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node_grp,
    pub name: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_grp__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
    >() - 64usize];
    ["Alignment of lysp_node_grp__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_grp__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::parent"][::std::mem::offset_of!(
        lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
        parent
    )
        - 0usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::nodetype"][::std::mem::offset_of!(
        lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
        nodetype
    )
        - 8usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::name"][::std::mem::offset_of!(
        lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
        name
    )
        - 24usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::iffeatures"]
        [::std::mem::offset_of!(
            lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
            iffeatures
        ) - 48usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_grp__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_grp__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_grp__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_grp__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_grp__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_grp__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_grp__bindgen_ty_1::node"]
        [::std::mem::offset_of!(lysp_node_grp__bindgen_ty_1, node) - 0usize];
};
impl Default for lysp_node_grp__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_grp"]
        [::std::mem::size_of::<lysp_node_grp>() - 104usize];
    ["Alignment of lysp_node_grp"]
        [::std::mem::align_of::<lysp_node_grp>() - 8usize];
    ["Offset of field: lysp_node_grp::typedefs"]
        [::std::mem::offset_of!(lysp_node_grp, typedefs) - 64usize];
    ["Offset of field: lysp_node_grp::groupings"]
        [::std::mem::offset_of!(lysp_node_grp, groupings) - 72usize];
    ["Offset of field: lysp_node_grp::child"]
        [::std::mem::offset_of!(lysp_node_grp, child) - 80usize];
    ["Offset of field: lysp_node_grp::actions"]
        [::std::mem::offset_of!(lysp_node_grp, actions) - 88usize];
    ["Offset of field: lysp_node_grp::notifs"]
        [::std::mem::offset_of!(lysp_node_grp, notifs) - 96usize];
};
impl Default for lysp_node_grp {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lysp_node_augment {
    pub __bindgen_anon_1: lysp_node_augment__bindgen_ty_1,
    pub child: *mut lysp_node,
    pub when: *mut lysp_when,
    pub actions: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lysp_node_augment__bindgen_ty_1 {
    pub node: lysp_node,
    pub __bindgen_anon_1: lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_node_augment__bindgen_ty_1__bindgen_ty_1 {
    pub parent: *mut lysp_node,
    pub nodetype: u16,
    pub flags: u16,
    pub next: *mut lysp_node_augment,
    pub nodeid: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
    pub iffeatures: *mut lysp_qname,
    pub exts: *mut lysp_ext_instance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_augment__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_augment__bindgen_ty_1__bindgen_ty_1>(
        ) - 64usize];
    ["Alignment of lysp_node_augment__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_augment__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::parent"]
        [::std::mem::offset_of!(
            lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
            parent
        ) - 0usize];
    [
        "Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::nodetype",
    ][::std::mem::offset_of!(
        lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
        nodetype
    ) - 8usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::flags"][::std::mem::offset_of!(
        lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
        flags
    )
        - 10usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::next"][::std::mem::offset_of!(
        lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
        next
    )
        - 16usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::nodeid"]
        [::std::mem::offset_of!(
            lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
            nodeid
        ) - 24usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::dsc"][::std::mem::offset_of!(
        lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
        dsc
    )
        - 32usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::ref_"][::std::mem::offset_of!(
        lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
        ref_
    )
        - 40usize];
    [
        "Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::iffeatures",
    ][::std::mem::offset_of!(
        lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
        iffeatures
    ) - 48usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1__bindgen_ty_1::exts"][::std::mem::offset_of!(
        lysp_node_augment__bindgen_ty_1__bindgen_ty_1,
        exts
    )
        - 56usize];
};
impl Default for lysp_node_augment__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_augment__bindgen_ty_1"]
        [::std::mem::size_of::<lysp_node_augment__bindgen_ty_1>() - 64usize];
    ["Alignment of lysp_node_augment__bindgen_ty_1"]
        [::std::mem::align_of::<lysp_node_augment__bindgen_ty_1>() - 8usize];
    ["Offset of field: lysp_node_augment__bindgen_ty_1::node"][::std::mem::offset_of!(
        lysp_node_augment__bindgen_ty_1,
        node
    ) - 0usize];
};
impl Default for lysp_node_augment__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_node_augment"]
        [::std::mem::size_of::<lysp_node_augment>() - 96usize];
    ["Alignment of lysp_node_augment"]
        [::std::mem::align_of::<lysp_node_augment>() - 8usize];
    ["Offset of field: lysp_node_augment::child"]
        [::std::mem::offset_of!(lysp_node_augment, child) - 64usize];
    ["Offset of field: lysp_node_augment::when"]
        [::std::mem::offset_of!(lysp_node_augment, when) - 72usize];
    ["Offset of field: lysp_node_augment::actions"]
        [::std::mem::offset_of!(lysp_node_augment, actions) - 80usize];
    ["Offset of field: lysp_node_augment::notifs"]
        [::std::mem::offset_of!(lysp_node_augment, notifs) - 88usize];
};
impl Default for lysp_node_augment {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub mod LYS_VERSION {
    pub type Type = ::std::os::raw::c_uint;
    pub const LYS_VERSION_UNDEF: Type = 0;
    pub const LYS_VERSION_1_0: Type = 1;
    pub const LYS_VERSION_1_1: Type = 2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_module {
    pub mod_: *mut lys_module,
    pub revs: *mut lysp_revision,
    pub imports: *mut lysp_import,
    pub includes: *mut lysp_include,
    pub extensions: *mut lysp_ext,
    pub features: *mut lysp_feature,
    pub identities: *mut lysp_ident,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub data: *mut lysp_node,
    pub augments: *mut lysp_node_augment,
    pub rpcs: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
    pub deviations: *mut lysp_deviation,
    pub exts: *mut lysp_ext_instance,
    pub version: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_module"][::std::mem::size_of::<lysp_module>() - 128usize];
    ["Alignment of lysp_module"]
        [::std::mem::align_of::<lysp_module>() - 8usize];
    ["Offset of field: lysp_module::mod_"]
        [::std::mem::offset_of!(lysp_module, mod_) - 0usize];
    ["Offset of field: lysp_module::revs"]
        [::std::mem::offset_of!(lysp_module, revs) - 8usize];
    ["Offset of field: lysp_module::imports"]
        [::std::mem::offset_of!(lysp_module, imports) - 16usize];
    ["Offset of field: lysp_module::includes"]
        [::std::mem::offset_of!(lysp_module, includes) - 24usize];
    ["Offset of field: lysp_module::extensions"]
        [::std::mem::offset_of!(lysp_module, extensions) - 32usize];
    ["Offset of field: lysp_module::features"]
        [::std::mem::offset_of!(lysp_module, features) - 40usize];
    ["Offset of field: lysp_module::identities"]
        [::std::mem::offset_of!(lysp_module, identities) - 48usize];
    ["Offset of field: lysp_module::typedefs"]
        [::std::mem::offset_of!(lysp_module, typedefs) - 56usize];
    ["Offset of field: lysp_module::groupings"]
        [::std::mem::offset_of!(lysp_module, groupings) - 64usize];
    ["Offset of field: lysp_module::data"]
        [::std::mem::offset_of!(lysp_module, data) - 72usize];
    ["Offset of field: lysp_module::augments"]
        [::std::mem::offset_of!(lysp_module, augments) - 80usize];
    ["Offset of field: lysp_module::rpcs"]
        [::std::mem::offset_of!(lysp_module, rpcs) - 88usize];
    ["Offset of field: lysp_module::notifs"]
        [::std::mem::offset_of!(lysp_module, notifs) - 96usize];
    ["Offset of field: lysp_module::deviations"]
        [::std::mem::offset_of!(lysp_module, deviations) - 104usize];
    ["Offset of field: lysp_module::exts"]
        [::std::mem::offset_of!(lysp_module, exts) - 112usize];
    ["Offset of field: lysp_module::version"]
        [::std::mem::offset_of!(lysp_module, version) - 120usize];
};
impl Default for lysp_module {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl lysp_module {
    #[inline]
    pub fn parsing(&self) -> u8 {
        unsafe {
            ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8)
        }
    }
    #[inline]
    pub fn set_parsing(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn parsing_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                    ::std::ptr::addr_of!((*this)._bitfield_1),
                    0usize,
                    1u8,
                ) as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_parsing_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_submod(&self) -> u8 {
        unsafe {
            ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8)
        }
    }
    #[inline]
    pub fn set_is_submod(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_submod_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                    ::std::ptr::addr_of!((*this)._bitfield_1),
                    1usize,
                    1u8,
                ) as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_is_submod_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        parsing: u8,
        is_submod: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let parsing: u8 = unsafe { ::std::mem::transmute(parsing) };
            parsing as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_submod: u8 = unsafe { ::std::mem::transmute(is_submod) };
            is_submod as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lysp_submodule {
    pub mod_: *mut lys_module,
    pub revs: *mut lysp_revision,
    pub imports: *mut lysp_import,
    pub includes: *mut lysp_include,
    pub extensions: *mut lysp_ext,
    pub features: *mut lysp_feature,
    pub identities: *mut lysp_ident,
    pub typedefs: *mut lysp_tpdf,
    pub groupings: *mut lysp_node_grp,
    pub data: *mut lysp_node,
    pub augments: *mut lysp_node_augment,
    pub rpcs: *mut lysp_node_action,
    pub notifs: *mut lysp_node_notif,
    pub deviations: *mut lysp_deviation,
    pub exts: *mut lysp_ext_instance,
    pub version: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub name: *const ::std::os::raw::c_char,
    pub filepath: *const ::std::os::raw::c_char,
    pub prefix: *const ::std::os::raw::c_char,
    pub org: *const ::std::os::raw::c_char,
    pub contact: *const ::std::os::raw::c_char,
    pub dsc: *const ::std::os::raw::c_char,
    pub ref_: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lysp_submodule"]
        [::std::mem::size_of::<lysp_submodule>() - 184usize];
    ["Alignment of lysp_submodule"]
        [::std::mem::align_of::<lysp_submodule>() - 8usize];
    ["Offset of field: lysp_submodule::mod_"]
        [::std::mem::offset_of!(lysp_submodule, mod_) - 0usize];
    ["Offset of field: lysp_submodule::revs"]
        [::std::mem::offset_of!(lysp_submodule, revs) - 8usize];
    ["Offset of field: lysp_submodule::imports"]
        [::std::mem::offset_of!(lysp_submodule, imports) - 16usize];
    ["Offset of field: lysp_submodule::includes"]
        [::std::mem::offset_of!(lysp_submodule, includes) - 24usize];
    ["Offset of field: lysp_submodule::extensions"]
        [::std::mem::offset_of!(lysp_submodule, extensions) - 32usize];
    ["Offset of field: lysp_submodule::features"]
        [::std::mem::offset_of!(lysp_submodule, features) - 40usize];
    ["Offset of field: lysp_submodule::identities"]
        [::std::mem::offset_of!(lysp_submodule, identities) - 48usize];
    ["Offset of field: lysp_submodule::typedefs"]
        [::std::mem::offset_of!(lysp_submodule, typedefs) - 56usize];
    ["Offset of field: lysp_submodule::groupings"]
        [::std::mem::offset_of!(lysp_submodule, groupings) - 64usize];
    ["Offset of field: lysp_submodule::data"]
